[{
        "id": 1,
        "title": "History Of Cricket",
        "category": "Sports",
        "textInfo": "There is a consensus of expert opinion that cricket may have been invented during Saxon or Norman times by children living in the Weald, an area of dense woodlands and clearings in south-east England. The first reference to cricket being played as an adult sport was in 1611, and in the same year, a dictionary defined cricket as a boys' game. There is also the thought that cricket may have derived from bowls, by the intervention of a batsman trying to stop the ball from reaching its target by hitting it away.\nIn the first half of the 18th Century cricket established itself as a leading sport in London and the south-eastern counties of England. Its spread was limited by the constraints of travel, but it was slowly gaining popularity in other parts of England and Women’s Cricket dates back to the 1745, when the first known match was played in Surrey.\nIn 1744, the first Laws of Cricket were written and subsequently amended in 1774, when innovations such as lbw, a 3rd stump, - the middle stump and a maximum bat width were added. The codes were drawn up by the “Star and Garter Club” whose members ultimately founded the famous Marylebone Cricket Club at Lord's in 1787. MCC immediately became the custodian of the Laws and has made revisions ever since then to the current day.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/ImageAndJson/images/history_of_cricket.jpg?raw=true",
        "sourceUrl": "https://www.icc-cricket.com/about/cricket/history-of-cricket/early-cricket",
        "subCategory": "Cricket",
        "isSubCategory": true
    },
    {
        "id": 2,
        "title": "Cricket in India",
        "category": "Sports",
        "textInfo": "It was sometime in 1721 that a British ship dropped anchor off the coast of Kutch in western India. The recreational activities the sailors indulged in on the coast elicited curious reactions from onlookers. One of the sailors, who answered to the name of Downing, recalled his time on the Kutch coast in his memoirs thus: \"We everyday diverted ourselves with playing cricket and other exercises\"\n This is the earliest recorded reference to cricket in India.\nAs the merchants metamorphosed into rulers, they continued to demonstrate their recreational pursuits on Indian soil. The British army took on the English settlers in what was the first recorded cricket match in India in 1751.\nThe establishment of the Calcutta Cricket Club (what we know today as CC & FC) in 1792, was another watershed for the sport in the land. In fact, it is the second-oldest cricket club in the world, after the MCC (1787).",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_india_cricket.jpeg?raw=true",
        "sourceUrl": "https://www.bcci.tv/about",
        "subCategory": "Cricket",
        "isSubCategory": true
    },
    {
        "id": 3,
        "title": "The first cricket ball was made of wool",
        "category": "Sports",
        "textInfo": "Although no one knows for sure how cricket started, it thought that it was invented by shepherds, who came up with the idea as a way to pass the time whilst guarding their sheep. Our first fact about cricket is that the first cricket ball was most likely a ball of rolled up wool – so today’s bowling speeds were most likely unachievable.\nThe first official mention of cricket in England was in 1597, when a court case relating to the ownership of a plot of land referred to the game of “creckett”. It was to be several centuries before international cricket came about though, with the first official test match taking place in 1877. It pitted England against Australia at the iconic Melbourne Cricket Ground, with the Aussies taking the win.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/first_cricket_ball_made_of_wool.jpg?raw=true",
        "sourceUrl": "https://dayoutinengland.com/facts-about-cricket-in-england/",
        "subCategory": "Cricket",
        "isSubCategory": true
    },
    {
        "id": 4,
        "title": "The longest cricket match was 14 days long",
        "category": "Sports",
        "textInfo": "It’s often joked in England that cricket goes on for far too long, with games often lasting for hours, especially with frequent breaks thanks to the indecisive British weather (cricket can’t be played in the rain or strong wind). But the longest ever cricket match was played in 1939, in a contest between England and South Africa. Forget hours, this match lasted a ridiculous 14 days.\nAnd even then the game had to be declared as a draw before it was finished, because the English ship was due to leave to take the team back home.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/longest_cricket_math_14_days.jpg?raw=true",
        "sourceUrl": "https://dayoutinengland.com/facts-about-cricket-in-england/",
        "subCategory": "Cricket",
        "isSubCategory": true
    },
    {
        "id": 5,
        "title": "Cricket is the second most popular sport in the world",
        "category": "Sports",
        "textInfo": "Cricket has grown and grown since its inception in the 16th century. It’s now enjoyed in over 180 countries around the world, with approximately 2.5 billion fans watching or playing the sport. How crazy are those numbers!?\nIt’s most popular in India and Pakistan, though England and Australia have two of the most famous teams.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/cricket_second_most_popular_sport.jpg?raw=true",
        "sourceUrl": "https://www.funfactsabout.com/fun-facts-about-cricket/",
        "subCategory": "Cricket",
        "isSubCategory": true
    },
    {
        "id": 6,
        "title": "History of Formula 1",
        "category": "Sports",
        "textInfo": "The modern era of Formula One began in 1950, but the roots of Grand Prix racing are far earlier, tracing to the pioneering road races in France in the 1890s, through the Edwardian years, the bleak twenties, the German domination of the 1930s and the early post-war years of Italian supremacy.\nRegarded as the first motor race proper was a 1,200 km road race from Paris to Bordeaux and back in 1895, won by Émile Levassor with his Panhard et Levassor in 48 hours. One of the most successful drivers of the early year was Fernand Charron, who won the Paris-Bordeaux race in 1899, also in a Panhard, at the blazing average speed of 29.9 mph.\nThe first race using the appellation “Grand Prix” was 1901’s French Grand Prix at Le Mans, won by Ferencz Szisz with a Renault, who covered the 700 miles at 63.0 mph.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_formula_1.jpg?raw=true",
        "sourceUrl": "http://www.f1-grandprix.com/?page_id=222",
        "subCategory": "Formula 1",
        "isSubCategory": true
    },
    {
        "id": 7,
        "title": "History of Ferrari",
        "category": "Sports",
        "textInfo": "Scuderia Ferrari was founded by Enzo Ferrari in 1929 to enter amateur drivers in various races. However, Ferrari himself had raced in CMN (Costruzioni Meccaniche Nazionali) and Alfa Romeo cars before that date. The idea came about on the night of 16 November at a dinner in Bologna, where Ferrari solicited financial help from textile heirs Augusto and Alfredo Caniato and wealthy amateur racer Mario Tadini. He then gathered a team which at its peak included over forty drivers, most of whom raced in various Alfa Romeo 8C cars; Ferrari himself continued racing, with moderate success, until the birth of his first son Dino in 1932. The well-known prancing horse blazon first appeared at the 1932 Spa 24 Hours in Belgium on a two-car team of Alfa Romeo 8C 2300 Spiders, which finished first and second.\nIn 1933 Alfa Romeo experienced economic difficulties and withdrew its in-house team from racing. From then, the Scuderia Ferrari became the acting racing team of Alfa Romeo when the factory released to the Scuderia the up-to-date Monoposto Tipo B racers. In 1935 Enzo Ferrari and Luigi Bazzi built the Alfa Romeo Bimotore, the first car to wear a Ferrari badge on the radiator cowl.\nIn the winter of 1939–1940, Ferrari started work on a racecar of his own, the Tipo 815 (eight cylinders, 1.5 L displacement). The 815s, designed by Alberto Massimino, were thus the first true Ferrari cars, but after Alberto Ascari and the Marchese Lotario Rangoni Machiavelli di Modena drove them in the 1940 Mille Miglia, World War II put a temporary end to racing and the 815s saw no more competition.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ferrari_history.png?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Scuderia_Ferrari",
        "subCategory": "Formula 1",
        "isSubCategory": true
    },
    {
        "id": 8,
        "title": "F1 Cars Have 80k Components",
        "category": "Sports",
        "textInfo": "Engineers assemble 80,000 components for just one car. Take note that all of these components are important to perform well during the race.\nThis is why it must be properly placed and assembled. It takes time to finalize the parts to be put in an F1 car and test their efficiency.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/f1_car_80k_component.jpg?raw=true",
        "sourceUrl": "https://xsportnet.com/fun-facts-that-few-people-know-about-formula-1/",
        "subCategory": "Formula 1",
        "isSubCategory": true
    },
    {
        "id": 9,
        "title": "F1 Drivers Lose Weight During Race",
        "category": "Sports",
        "textInfo": "F1 cars are hot; literally, F1 drivers are exposed to this high level of heat during a competition. You also have to take note that cockpits in the race track are heated as well.\nWith this immense heat, F1 drivers lose an average of 4kgs in a single match.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/f1_drivers_lose_weight.jpg?raw=true",
        "sourceUrl": "https://xsportnet.com/fun-facts-that-few-people-know-about-formula-1/",
        "subCategory": "Formula 1",
        "isSubCategory": true
    },
    {
        "id": 10,
        "title": "History of Baseball",
        "category": "Sports",
        "textInfo": "References to games resembling baseball in the United States date back to the 18th century. Its most direct ancestors appear to be two English games: rounders (a children’s game brought to New England by the earliest colonists) and cricket.\nIn September 1845, a group of New York City men founded the New York Knickerbocker Baseball Club. One of them—volunteer firefighter and bank clerk Alexander Joy Cartwright—would codify a new set of rules that would form the basis for modern baseball, calling for a diamond-shaped infield, foul lines and the three-strike rule. He also abolished the dangerous practice of tagging runners by throwing balls at them.\nCartwright’s changes made the burgeoning pastime faster-paced and more challenging while clearly differentiating it from older games like cricket. In 1846, the Knickerbockers played the first official game of baseball against a team of cricket players, beginning a new, uniquely American tradition.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_baseball.jpeg?raw=true",
        "sourceUrl": "https://www.history.com/news/who-invented-baseball",
        "subCategory": "Baseball",
        "isSubCategory": true
    },
    {
        "id": 11,
        "title": "History of New York Yankees",
        "category": "Sports",
        "textInfo": "The franchise began in 1901 in Baltimore, Maryland, competing as the Orioles in the AL for two seasons. The struggling Baltimore team was bought by Frank Farrell and Bill Devery in 1903 and taken to New York, initially to Hilltop Park (1903–12), one of Manhattan’s highest points, which led to the name New York Highlanders. Local sportswriters often referred to the team as “Yankees” or “Yanks,” because the team was in the American League. After the club moved to the Polo Grounds in 1913, the name Highlanders fell further into disuse, and the team was officially renamed the Yankees.\nThe team was not a regular pennant contender during its first 18 years in New York. Its fortunes changed completely in 1920, however, with the acquisition of Ruth from the Red Sox for cash and a loan against Boston’s Fenway Park—the most famous sale in baseball history. With the superstar pitcher-turned-outfielder leading the charge, the Yankees dynasty began to take shape during his second season with the team. It won three consecutive AL championships and the team’s first World Series title (1923).",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_new_york_yankees.jpeg?raw=true",
        "sourceUrl": "https://www.britannica.com/topic/New-York-Yankees",
        "subCategory": "Baseball",
        "isSubCategory": true
    },
    {
        "id": 12,
        "title": "What is the oldest known piece of music?",
        "category": "Music",
        "textInfo": "The history of music is as old as humanity itself. Archaeologists have found primitive flutes made of bone and ivory dating back as far as 43,000 years, and it’s likely that many ancient musical styles have been preserved in oral traditions.\nWhen it comes to specific songs, however, the oldest known examples are relatively more recent. The earliest fragment of musical notation is found on a 4,000-year-old Sumerian clay tablet, which includes instructions and tunings for a hymn honoring the ruler Lipit-Ishtar. But for the title of oldest extant song, most historians point to “Hurrian Hymn No. 6,” an ode to the goddess Nikkal that was composed in cuneiform by the ancient Hurrians sometime around the 14th century B.C.\n“Hurrian Hymn No. 6” is considered the world’s earliest melody, but the oldest musical composition to have survived in its entirety is a first century A.D. Greek tune known as the “Seikilos Epitaph.” The song was found engraved on an ancient marble column used to mark a woman’s gravesite in Turkey. “I am a tombstone, an image,” reads an inscription. Seikilos placed me here as an everlasting sign of deathless remembrance.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/oldest_peice_of_music.jpeg?raw=true",
        "sourceUrl": "https://www.history.com/news/what-is-the-oldest-known-piece-of-music",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 13,
        "title": "Opera history",
        "category": "Music",
        "textInfo": "Opera originated in Italy at the end of the 16th century (with Jacopo Peri's mostly lost Dafne, produced in Florence in 1598) especially from works by Claudio Monteverdi, notably L'Orfeo, and soon spread through the rest of Europe Dafne by Jacopo Peri was the earliest composition considered opera, as understood today. It was written around 1597, largely under the inspiration of an elite circle of literate Florentine humanists who gathered as the Camerata de Bardi.\nA later work by Peri, Euridice, dating from 1600, is the first opera score to have survived until the present day. However, the honour of being the first opera still to be regularly performed goes to Claudio Monteverdi's L'Orfeo, composed for the court of Mantua in 1607.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_opera.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Opera",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 14,
        "title": "Rock Music",
        "category": "Music",
        "textInfo": "The history of rock music has been volatile and unpredictable as the genre has constantly redefined and reinvented itself since its emergence in the late 1940s.\nRock’s origins can be traced to the late 1940s, when the popular styles of the day, country music and blues, morphed into a new sound aided by electric guitars and a steady drumbeat. Pioneering rock artists of the 1950s such as Chuck Berry leaned heavily on classic blues structures while demonstrating a flair as natural-born entertainers.\nAs the '80s began, mainstream rock was losing commercial steam, its sound growing stale. In such a creatively stagnant environment, subgenres started to assert their dominance.\nInspired by punk’s outsider status and industrial’s eclectic instrumentation, keyboard-driven English bands such as Depeche Mode demonstrated a more introverted songwriting style, creating post-punk, also described as new wave.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_rock_music.jpeg?raw=true",
        "sourceUrl": "https://www.liveabout.com/what-is-rock-music-2898293",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 15,
        "title": "Ancient India",
        "category": "Countries",
        "textInfo": "By 55,000 years ago, the first modern humans, or Homo sapiens, had arrived on the Indian subcontinent from Africa, where they had earlier evolved. The earliest known modern human remains in South Asia date to about 30,000 years ago.\nDuring the period 2000–500 BCE, many regions of the subcontinent transitioned from the Chalcolithic cultures to the Iron Age ones. The Vedas, the oldest scriptures associated with Hinduism, were composed during this period, and historians have analysed these to posit a Vedic culture in the Punjab region and the upper Gangetic Plain. Most historians also consider this period to have encompassed several waves of Indo-Aryan migration into the subcontinent from the north-west.\nIn the late Vedic period, around the 6th century BCE, the small states and chiefdoms of the Ganges Plain and the north-western regions had consolidated into 16 major oligarchies and monarchies that were known as the mahajanapadas. The emerging urbanisation gave rise to non-Vedic religious movements, two of which became independent religions. Jainism came into prominence during the life of its exemplar, Mahavira. Buddhism, based on the teachings of Gautama Buddha, attracted followers from all social classes excepting the middle class; chronicling the life of the Buddha was central to the beginnings of recorded history in India.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_ancient_india.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 16,
        "title": "Medieval India",
        "category": "Countries",
        "textInfo": "The Indian early medieval age, from 600 to 1200 CE, is defined by regional kingdoms and cultural diversity. When Harsha of Kannauj, who ruled much of the Indo-Gangetic Plain from 606 to 647 CE, attempted to expand southwards, he was defeated by the Chalukya ruler of the Deccan. When his successor attempted to expand eastwards, he was defeated by the Pala king of Bengal. When the Chalukyas attempted to expand southwards, they were defeated by the Pallavas from farther south, who in turn were opposed by the Pandyas and the Cholas from still farther south.\nIn the 6th and 7th centuries, the first devotional hymns were created in the Tamil language.They were imitated all over India and led to both the resurgence of Hinduism and the development of all modern languages of the subcontinent.Indian royalty, big and small, and the temples they patronised drew citizens in great numbers to the capital cities, which became economic hubs as well. Temple towns of various sizes began to appear everywhere as India underwent another urbanisation.\nBy the 8th and 9th centuries, the effects were felt in South-East Asia, as South Indian culture and political systems were exported to lands that became part of modern-day Myanmar, Thailand, Laos, Brunei, Cambodia, Vietnam, Philippines, Malaysia, and Indonesia.Indian merchants, scholars, and sometimes armies were involved in this transmission; South-East Asians took the initiative as well, with many sojourning in Indian seminaries and translating Buddhist and Hindu texts into their languages.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_medieval_india.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 17,
        "title": "Early Modern India",
        "category": "Countries",
        "textInfo": "In the early 16th century, northern India, then under mainly Muslim rulers, fell again to the superior mobility and firepower of a new generation of Central Asian warriors. The resulting Mughal Empire did not stamp out the local societies it came to rule. Instead, it balanced and pacified them through new administrative practices and diverse and inclusive ruling elites, leading to more systematic, centralised, and uniform rule.\n By the early 18th century, with the lines between commercial and political dominance being increasingly blurred, a number of European trading companies, including the English East India Company, had established coastal outposts.The East India Company's control of the seas, greater resources, and more advanced military training and technology led it to increasingly assert its military strength and caused it to become attractive to a portion of the Indian elite; these factors were crucial in allowing the company to gain control over the Bengal region by 1765 and sideline the other European companies.\nBy this time, with its economic power severely curtailed by the British parliament and having effectively been made an arm of British administration, the East India Company began more consciously to enter non-economic arenas, including education, social reform and culture.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/early_modern_india.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 18,
        "title": "Modern India",
        "category": "Countries",
        "textInfo": "Historians consider India's modern age to have begun sometime between 1848 and 1885. The appointment in 1848 of Lord Dalhousie as Governor General of the East India Company set the stage for changes essential to a modern state. These included the consolidation and demarcation of sovereignty, the surveillance of the population, and the education of citizens. Technological changes—among them, railways, canals, and the telegraph—were introduced not long after their introduction in Europe.\nFed by diverse resentments and perceptions, including invasive British-style social reforms, harsh land taxes, and summary treatment of some rich landowners and princes, the rebellion rocked many regions of northern and central India and shook the foundations of Company rule. Although the rebellion was suppressed by 1858, it led to the dissolution of the East India Company and the direct administration of India by the British government.\nThe rush of technology and the commercialisation of agriculture in the second half of the 19th century was marked by economic setbacks and many small farmers became dependent on the whims of far-away markets. There was an increase in the number of large-scale famines, and, despite the risks of infrastructure development borne by Indian taxpayers, little industrial employment was generated for Indians.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/modern_india.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 19,
        "title": "History of United States",
        "category": "Countries",
        "textInfo": "The history of the lands that became the United States began with the arrival of the first people in the Americas around 15,000 BC. Numerous indigenous cultures formed, and many saw transformations in the 16th century away from more densely populated lifestyles and towards reorganized polities elsewhere. The European colonization of the Americas began in the late 15th century, however most colonies in what would later become the United States were settled after 1600. By the 1760s, the thirteen British colonies contained 2.5 million people and were established along the Atlantic Coast east of the Appalachian Mountains.\nIn 1776, in Philadelphia, the Second Continental Congress declared the independence of the colonies as the United States. Led by General George Washington, it won the Revolutionary War. The peace treaty of 1783 established the borders of the new nation. The Articles of Confederation established a central government, but it was ineffectual at providing stability as it could not collect taxes and had no executive officer. A convention wrote a new Constitution that was adopted in 1789 and a Bill of Rights was added in 1791 to guarantee inalienable rights. With Washington as the first president and Alexander Hamilton his chief adviser, a strong central government was created. Purchase of the Louisiana Territory from France in 1803 doubled the size of the United States.\nThe United States became the world's leading industrial power at the turn of the 20th century, due to an outburst of entrepreneurship and industrialization and the arrival of millions of immigrant workers and farmers. A national railroad network was completed and large-scale mines and factories were established.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_united_states.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_the_United_States",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 20,
        "title": "Prehistory of England",
        "category": "Countries",
        "textInfo": "The earliest known evidence of human presence in the area now known as England was that of Homo antecessor, dating to approximately 780,000 years ago. The oldest proto-human bones discovered in England date from 500,000 years ago. Modern humans are known to have inhabited the area during the Upper Paleolithic period, though permanent settlements were only established within the last 6,000 years.\nThe Beaker culture arrived around 2,500 BC, introducing drinking and food vessels constructed from clay, as well as vessels used as reduction pots to smelt copper ores. It was during this time that major Neolithic monuments such as Stonehenge and Avebury were constructed. By heating together tin and copper, which were in abundance in the area, the Beaker culture people made bronze, and later iron from iron ores.\nDuring the Iron Age, Celtic culture, deriving from the Hallstatt and La Tène cultures, arrived from Central Europe. Brythonic was the spoken language during this time. Society was tribal; according to Ptolemy's Geographia there were around 20 tribes in the area. Earlier divisions are unknown because the Britons were not literate. Like other regions on the edge of the Empire, Britain had long enjoyed trading links with the Romans.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_united_states.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/England",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 21,
        "title": "England in the Middle Ages",
        "category": "Countries",
        "textInfo": "Roman military withdrawals left Britain open to invasion by pagan, seafaring warriors from north-western continental Europe, chiefly the Saxons, Angles, Jutes and Frisians who had long raided the coasts of the Roman province. These groups then began to settle in increasing numbers over the course of the fifth and sixth centuries, initially in the eastern part of the country. Their advance was contained for some decades after the Britons' victory at the Battle of Mount Badon, but subsequently resumed, overrunning the fertile lowlands of Britain and reducing the area under Brittonic control to a series of separate enclaves in the more rugged country to the west by the end of the 6th century.\nDuring the settlement period the lands ruled by the incomers seem to have been fragmented into numerous tribal territories, but by the 7th century, when substantial evidence of the situation again becomes available, these had coalesced into roughly a dozen kingdoms including Northumbria, Mercia, Wessex, East Anglia, Essex, Kent and Sussex. Over the following centuries, this process of political consolidation continued. The 7th century saw a struggle for hegemony between Northumbria and Mercia, which in the 8th century gave way to Mercian preeminence.\nDuring the 14th century, the Plantagenets and the House of Valois both claimed to be legitimate claimants to the House of Capet and with it France; the two powers clashed in the Hundred Years' War. The Black Death epidemic hit England; starting in 1348, it eventually killed up to half of England's inhabitants. From 1453 to 1487 civil war occurred between two branches of the royal family – the Yorkists and Lancastrians – known as the Wars of the Roses.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/england_in_middle_ages.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/England",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 22,
        "title": "England in Early Modern Era",
        "category": "Countries",
        "textInfo": "During the Tudor period, the Renaissance reached England through Italian courtiers, who reintroduced artistic, educational and scholarly debate from classical antiquity. England began to develop naval skills, and exploration to the West intensified.\nCompeting with Spain, the first English colony in the Americas was founded in 1585 by explorer Walter Raleigh in Virginia and named Roanoke. The Roanoke colony failed and is known as the lost colony after it was found abandoned on the return of the late-arriving supply ship. With the East India Company, England also competed with the Dutch and French in the East.\nIn 1666 the Great Fire of London gutted the City of London but it was rebuilt shortly afterwards with many significant buildings designed by Christopher Wren. In Parliament two factions had emerged – the Tories and Whigs. Though the Tories initially supported Catholic king James II, some of them, along with the Whigs, during the Revolution of 1688 invited Dutch prince William of Orange to defeat James and ultimately to become William III of England. Some English people, especially in the north, were Jacobites and continued to support James and his sons.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/early_modern_era_of_england.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/England",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 23,
        "title": "History of Spain",
        "category": "Countries",
        "textInfo": "The history of Spain dates to the pre-Roman peoples of the Mediterranean coast of the Iberian Peninsula made contact with the Greeks and Phoenicians and the first writing systems known as Paleohispanic scripts were developed. During Classical Antiquity, the peninsula was the site of multiple successive colonizations of Greeks, Carthaginians, and Romans. Native peoples of the peninsula, such as the Tartessos people, intermingled with the colonizers to create a uniquely Iberian culture. The Romans referred to the entire Peninsula as Hispania, from where the modern name of Spain originates. The region was divided up, at various times, into different Roman provinces.\nVarious Germanic kingdoms were established on the Iberian peninsula in the early 5th century CE in the wake of the fall of Roman control; germanic control lasted about 200 years until the Umayyad conquest of Hispania began in 711 and marked the introduction of Islam to the Iberian Peninsula.\nThe early modern period is generally dated from the union of the Crowns of Castile and Aragon under the Catholic Monarchs, Isabella I of Castile and Ferdinand II of Aragon in 1469. This marked what is historiographically considered the foundation of unified Spain, although technically Castile and Aragon continued to maintain independent institutions for several centuries. The conquest of Granada, and the first voyage of Columbus, both in 1492, made that year a critical inflection point in Spanish history.\nThe twentieth century began for Spain in foreign and domestic turmoil; the Spanish-American War led to losses of Spanish colonial possessions and a series of military dictatorships, first under Miguel Primo de Rivera and secondly under Dámaso Berenguer. During Berenguer's dictatorship, the king, Alfonso XIII was deposed and a new Republican government was formed. Ultimately, the political disorder within Spain led to a coup by the military which led to the Spanish Civil War, in which the Republican forces squared off against the Nationalists. After much foreign intervention on both sides, the Nationalists emerged victorious thanks to the help provided by Nazi Germany and Italy, their leader Francisco Franco, who led a fascist dictatorship for almost four decades.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_spain.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_Spain",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 24,
        "title": "History of Germany",
        "category": "Countries",
        "textInfo": "Pre-human ancestors, who were present in Germany over 11 million years ago, are theorized to be among the earliest ones to walk on two legs. Ancient humans were present in Germany at least 600,000 years ago. The first non-modern human fossil (the Neanderthal) was discovered in the Neander Valley. Similarly dated evidence of modern humans has been found in the Swabian Jura, including 42,000-year-old flutes which are the oldest musical instruments ever found, the 40,000-year-old Lion Man, and the 35,000-year-old Venus of Hohle Fels. The Nebra sky disk, created during the European Bronze Age, has been attributed to a German site.\nThe Germanic tribes are thought to date from the Nordic Bronze Age or the Pre-Roman Iron Age. From southern Scandinavia and north Germany, they expanded south, east, and west, coming into contact with the Celtic, Iranian, Baltic, and Slavic tribes.\nCharlemagne founded the Carolingian Empire in 800; it was divided in 843. The eastern successor kingdom of East Francia stretched from the Rhine in the west to the Elbe river in the east and from the North Sea to the Alps. Subsequently, the Holy Roman Empire emerged from it. The Ottonian rulers (919–1024) consolidated several major duchies.\nFollowing the fall of Napoleon, the Congress of Vienna founded the German Confederation, a loose league of 39 sovereign states. The appointment of the Emperor of Austria as the permanent president reflected the Congress's rejection of Prussia's rising influence. Disagreement within restoration politics partly led to the rise of liberal movements, followed by new measures of repression by Austrian statesman Klemens von Metternich. The Zollverein, a tariff union, furthered economic unity.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_germany.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Germany",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 25,
        "title": "History of Indian Civilization",
        "category": "Civilization",
        "textInfo": "According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between 73,000 and 55,000 years ago. However, the earliest known human remains in South Asia date to 30,000 years ago. Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around 7000 BCE.\nEarly on in the second millennium BCE, persistent drought caused the population of the Indus Valley to scatter from large urban centres to villages. Around the same time, Indo-Aryan tribes moved into the Punjab from Central Asia in several waves of migration. Their Vedic Period (1500–500 BCE) was marked by the composition of the Vedas, large collections of hymns of these tribes.\nMost of the Indian subcontinent was conquered by the Maurya Empire during the 4th and 3rd centuries BCE. From the 3rd century BCE onwards, Prakrit and Pali literature in the north and Tamil Sangam literature in southern India started to flourish. Wootz steel originated in south India in the 3rd century BCE and was exported. The Maurya Empire would collapse in 185 BCE, on the assassination of the then-Emperor Brihadratha by his General Pushyamitra Shunga. Shunga would go on to form the Shunga Empire in the North and Northeast of the subcontinent, while the Greco-Bactrian Kingdom would claim the Northwest, and found the Indo-Greek Kingdom.\nThe most significant event between the 7th and 11th century was the Tripartite struggle centred on Kannauj that lasted for more than two centuries between the Pala Empire, Rashtrakuta Empire, and Gurjara-Pratihara Empire. Southern India saw the rise of multiple imperial powers from the middle of the fifth century, most notably the Chalukya, Chola, Pallava, Chera, Pandyan, and Western Chalukya Empires. The Chola dynasty conquered southern India and successfully invaded parts of Southeast Asia, Sri Lanka, the Maldives, and Bengal in the 11th century. In the early medieval period Indian mathematics, including Hindu numerals, influenced the development of mathematics and astronomy in the Arab world.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_indian_civilization.JPG?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 26,
        "title": "History of Egypt Civilization",
        "category": "Civilization",
        "textInfo": "Ancient Egypt was a civilization in ancient Northeast Africa, situated in the Egyptian Nile Valley in Egypt. Ancient Egyptian civilization followed prehistoric Egypt and coalesced around 3100 BC (according to conventional Egyptian chronology)with the political unification of Upper and Lower Egypt under Menes (often identified with Narmer). The history of ancient Egypt occurred as a series of stable kingdoms, separated by periods of relative instability known as Intermediate Periods: the Old Kingdom of the Early Bronze Age, the Middle Kingdom of the Middle Bronze Age and the New Kingdom of the Late Bronze Age.\nEgypt reached the pinnacle of its power in the New Kingdom, ruling much of Nubia and a sizable portion of the Near East, after which it entered a period of slow decline. During the course of its history Egypt was invaded or conquered by a number of foreign powers, including the Hyksos, the Libyans, the Nubians, the Assyrians, the Achaemenid Persians, and the Macedonians under the command of Alexander the Great. The Greek Ptolemaic Kingdom, formed in the aftermath of Alexander's death, ruled Egypt until 30 BC, when, under Cleopatra, it fell to the Roman Empire and became a Roman province.\nThe success of ancient Egyptian civilization came partly from its ability to adapt to the conditions of the Nile River valley for agriculture. The predictable flooding and controlled irrigation of the fertile valley produced surplus crops, which supported a more dense population, and social development and culture.\nThe many achievements of the ancient Egyptians include the quarrying, surveying, and construction techniques that supported the building of monumental pyramids, temples, and obelisks; a system of mathematics, a practical and effective system of medicine, irrigation systems, and agricultural production techniques, the first known planked boats, Egyptian faience and glass technology, new forms of literature, and the earliest known peace treaty, made with the Hittites. Ancient Egypt has left a lasting legacy. Its art and architecture were widely copied, and its antiquities were carried off to far corners of the world. Its monumental ruins have inspired the imaginations of travelers and writers for millennia. A newfound respect for antiquities and excavations in the early modern period by Europeans and Egyptians led to the scientific investigation of Egyptian civilization and a greater appreciation of its cultural legacy.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_egypt_civilization.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_Egypt",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 27,
        "title": "Harappa Civilization",
        "category": "Civilization",
        "textInfo": "Harappa is an archaeological site in Punjab, Pakistan, about 24 km (15 mi) west of Sahiwal. The Bronze Age Harappan civilisation, now more often called the Indus Valley Civilisation, is named after the site, which takes its name from a modern village near the former course of the Ravi River, which now runs 8 km (5.0 mi) to the north. The core of the Harappan civilization extended over a large area, from Gujarat in the south, across Sindh and Rajasthan and extending into Punjab and Haryana. Numerous sites have been found outside the core area, including some as far east as Uttar Pradesh and as far west as Sutkagen-dor on the Makran coast of Baluchistan, not far from Iran.\nThe site of the ancient city contains the ruins of a Bronze Age fortified city, which was part of the Harappan civilisation centred in Sindh and the Punjab, and then the Cemetery H culture. The city is believed to have had as many as 23,500 residents and occupied about 150 hectares (370 acres) with clay brick houses at its greatest extent during the Mature Harappan phase (2600 BC – 1900 BC), which is considered large for its time. Per archaeological convention of naming a previously unknown civilisation by its first excavated site, the Indus Valley Civilisation is also called the Harappan Civilisation.\nThe ancient city of Harappa was heavily damaged under British rule, when bricks from the ruins were used as track ballast in the construction of the Lahore–Multan Railway. The current village of Harappa is less than 1 km (0.62 mi) from the ancient site. Although modern Harappa has a legacy railway station from the British Raj period, it is a small crossroads town of 15,000 people today. In 2005, a controversial amusement park scheme at the site was abandoned when builders unearthed many archaeological artefacts during the early stages of building work.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_harappa_civilization.jpg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Harappa",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 28,
        "title": "History of Soccer",
        "category": "Sports",
        "textInfo": "The first known examples of a team game involving a ball, which was made out of a rock, occurred in old Mesoamerican cultures for over 3,000 years ago. It was by the Aztecs called Tchatali, although various versions of the game were spread over large regions. In some ritual occasions, the ball would symbolize the sun and the captain of the losing team would be sacrificed to the gods.\nThe first known ball game which also involved kicking took place In China in the 3rd and 2nd century BC under the name cuju. Cuju was played with a round ball (stitched leather with fur or feathers inside) on an area of a square. A modified form of this game later spread to Japan and was by the name of kemari practiced under ceremonial forms.\nThe most admitted story tells that the game was developed in England in the 12th century. In this century, games that resembled football were played on meadows and roads in England. Besides from kicks, the game involved also punches of the ball with the fist. This early form of football was also much more rough and violent than the modern way of playing.\nAn important feature of the forerunners to football was that the games involved plenty of people and took place over large areas in towns (an equivalent was played in Florence from the 16th century where it was called Calcio). The rampage of these games would cause damage on the town and sometimes death to the participants. These would be among the reasons for the proclamations against the game that finally was forbidden for several centuries. But the football-like games would return to the streets of London in the 17th century. It would be forbidden again in 1835, but at this stage the game had been established in the public schools.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_soccer.jpeg?raw=true",
        "sourceUrl": "https://www.footballhistory.org",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 29,
        "title": "History of Soccer in England",
        "category": "Sports",
        "textInfo": "The earliest reference to football is in a 1314 decree issued by the Lord Mayor of London, Nicholas de Farndone, on behalf of King Edward II. Originally written in Norman French, a translation of the decree includes: for as much as there is great noise in the city caused by hustling over large footballs in the fields of the public, from which many evils might arise that God forbid: we command and forbid on behalf of the King, on pain of imprisonment, such game to be used in the city in the future. The earliest known reference to football that was written in English is a 1409 proclamation issued by King Henry IV.\nMore is known about folk football through the 18th and 19th centuries. It was essentially a game for large numbers played over wide distances with goals that were as much as three miles apart, as at Ashbourne. At Whitehaven, the goals were a harbour wall and a wall outside the town.\nIn the winter of 1855–56, players of Sheffield Cricket Club organised informal football matches to help them retain fitness. On 24 October 1857, they formally created Sheffield Football Club which is now recognised as the world's oldest association football club. On 21 October 1858, at the club's first annual general meeting, the club drafted the Sheffield Rules for use in its matches. Hacking was outlawed but the fair catch was allowed, providing the player did not hold onto the ball.\nIn October 1863, a revision of the Cambridge Rules was published. This was shortly before a meeting on Monday, 26 October, of twelve clubs and schools at the Freemasons' Tavern on Great Queen Street in London. Eleven of them agreed to form the Football Association (the FA). Running with the ball in hand was also banned but players could still make the fair catch to earn a free kick.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_soccer_england.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_football_in_England",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 30,
        "title": "Pele Set a Guinness World Record With 1,279 Goals",
        "category": "Sports",
        "textInfo": "Pelé, regarded by many to be the greatest soccer player of all time, scored 1,279 goals in his 1,363 total career matches. He holds the Guinness World Record for most goals scored by an individual in a specified period. Pelé holds a second Guinness World Record, as well: the most wins of the FIFA World Cup by a player.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/pele_guinness_world_record.jpeg?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 31,
        "title": "Cristiano Ronaldo Can Jump Higher Than an Olympic High Jumper",
        "category": "Sports",
        "textInfo": "Cristiano Ronaldo of Portugal has the record for most goals scored by an active player. He is the leading goalscorer for his club Real Madrid and holds the record for most goals in the FIFA World Cup and the UEFA Champions League. One of the reasons why Ronaldo can score so often is that he can jump 2.56 meters — 0.13 meters higher than the Olympic record set by Cuban high jumper Javier Sotomayor in 1993.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ronaldo_jump.jpeg?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 32,
        "title": "Diego Maradona Received 23 Fouls in One World Cup Match",
        "category": "Sports",
        "textInfo": "The mention of Argentine Diego Maradona's name is sure to receive a mixed reaction among soccer fans. Many believe Maradona to be the greatest soccer player ever, while others disliked his controversial behavior on and off the pitch. One example of Maradona's divisive reputation came to light in the 1986 World Cup when he famously scored the game-winning goal using his hand. Maradona later commented that the goal was scored a little bit by the hand of God, a little by the head of Maradona.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/maradona.jpeg?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 33,
        "title": "Players Run Up to 10 Miles During a Game",
        "category": "Sports",
        "textInfo": "At 110-120 yards, a FIFA soccer pitch is more than twice as long as a regulation American football field (53.3 yards). That means that between offensive and defensive play, team members constantly run up and down the pitch. An average soccer game results in players running 5-10 miles a game, depending on their position.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/soccer_pitch.png?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 34,
        "title": "Red and Yellow Cards Were First Used in the 1970 World Cup",
        "category": "Sports",
        "textInfo": "It seems like red and yellow cards are as old as the game of soccer itself, but that's not so. Soccer didn't even use referees until 1891; the players made the calls based on sportsmanship. But Ken Aston, a teacher-turned-referee, oversaw the 1962 World Cup which was overrun with conflict and fighting. He thought of a simple way to regulate discipline during the game: yellow means take it easy, red means stop. The cards made their debut at the 1970 World Cup in Mexico and became part of the game from that point on.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/soccer_red-and_yellow_cards.jpeg?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 35,
        "title": "History of Soccer in Spain",
        "category": "Sports",
        "textInfo": "Football is the most popular sport in Spain. Spain has some of the most important teams in Europe (Real Madrid, Barcelona, Atlético de Madrid, Seville, Valencia, and others). It also has a high number of players (most of them being unprofessional) and teams registered in all categories (a total of 1,063,090 players in a total of 21,148 clubs). Moreover, football is the sport that interests the majority of Spanish people (48%). A total of 67% of the population said they were fans or had a liking for a particular club.\nModern football was introduced to Spain in the late 19th century by a combination of mostly British immigrant workers, visiting sailors and Spanish students coming from Britain. In the late 1870s, various English workers scattered throughout the peninsula began to establish informal groups that were dedicated to different recreational practices, especially cricket and football, particularly in Spanish ports, such as the ones in Vigo, Andalusia, (Huelva and Seville) and Bilbao, who were the regions that most felt this movement.\nIn the late 19th century, Catalonia enjoyed the most developed industry in the country, mainly thanks to its cotton industry, and for this reason, Barcelona was the home to an important British colony. The first known football match in the city was held on the grounds near the Hippodrome of Can Tunis on 25 December 1892. Very little is known about that Christmas Day, only that it was the work of members of the Club Regatas de Barcelona (a club of rowing and sailing) and the British Club de Barcelona located on Rambla dels Capuchins.\nIn Madrid, the first games were promoted by Institución Libre de Enseñanza (ILE) (English: Free Educational Institution), an educational and cultural centre. The first official and registered football club in Madrid was Football Club Sky, founded in 1897, but a conflict between its members caused the club to split in two in 1900. Then, several clubs also emerged in Madrid, most notably Madrid Football Club, which was officially established in March 1902 by Catalan brothers Juan and Carlos Padrós.\nThe Spanish Federation of Football Clubs was formed in 1909, but there were discrepancies between the member clubs years later, and some of the clubs formed other association called Royal Spanish Union of Clubs of Football. Finally, the two associations reached an agreement and the Royal Spanish Football Federation was founded in 1913, which allowed the Spanish football to enter in FIFA. In these years, Athletic was the most dominant club in the country, and the first idols in Spain began to appear, like Pichichi and Paulino Alcántara.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_soccer_in_spain.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Football_in_Spain#cite_note-furia_roja-71",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 36,
        "title": "History of Soccer in United States",
        "category": "Sports",
        "textInfo": "The history of soccer in the United States has numerous different roots. Recent research has shown that the modern game entered America in the 1850s through New Orleans when Scottish, Irish, German and Italian immigrants brought the game with them. It was in New Orleans that some of the first organized games that used modern English rules were held.\nEarly versions of football were being played in the United States as early as 1685, and freshmen at Harvard University in 1734 were asked to provide foot-balls. This did not resemble modern soccer in any way, except that it involved various kicking activities, and was often violent. By the 1860s, several different sets of rules began to be codified, such as the Boston Game which was like a hybrid of rugby and soccer.\nThe 1869 Princeton vs. Rutgers football game is often cited to be the birth of intercollegiate American football, but it also considered the birth of soccer in the United States as well, as it was played with rules based on the Football Association's (FA) first set of rules. Although American football began to take hold at eastern universities such as Harvard, Princeton, and Yale, socker gained popularity at Haverford, Columbia, Cornell, and Penn. These enthusiasts arranged for English teams to tour the United States to generate interest in the sport in 1905, 1907, and 1909. Nevertheless, American football became the primary sport at most schools.\nTowards the end of the 1920s, a period in American soccer known as the American Soccer Wars ignited. The Soccer Wars regarded the internal conflicts with the American Soccer League and their affiliated clubs participating in the National Challenge Cup. The debate involved whether the United States Football Association or the American Soccer League was the true chief organization of American soccer at the time, and consequently wrecked the reputation and possibly even the popularity of the sport domestically.\nIn 1967, two professional soccer leagues started in the United States: the FIFA-sanctioned United Soccer Association, which consisted of entire European and South American teams brought to the US and given local names, and the unsanctioned National Professional Soccer League. The National Professional Soccer League had a national television contract in the U.S. with the CBS television network, but the ratings for matches were unacceptable even by weekend daytime standards and the arrangement was terminated. The leagues merged in 1968 to form the North American Soccer League (NASL). It has been suggested that the timing of the merger was related to the huge amount of attention given throughout the English-speaking world to the victory by England in the 1966 FIFA World Cup and the resulting documentary film, Goal. The league lasted until the 1984 NASL season.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_soccer_in_united_states.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_soccer_in_the_United_States",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 37,
        "title": "Over Half the Global Population Watched the 2020 World Cup",
        "category": "Sports",
        "textInfo": "An unbelievable 3.572 billion people around the world tuned in to watch the 2018 World Cup tournament that ended with a final match between France and Croatia. It was the third-most viewed television broadcast at the time, following the 2012 London Summer Olympics and the 2016 Rio Summer Olympics. The 2018 World Cup had 150 million more viewers than the 1998 World Cup, which had been the highest viewed World Cup to that point. The most-watched Women's World Cup was in 2019 with 1.12 billion viewers.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/fifa_world_cup_2018.jpeg?raw=true",
        "sourceUrl": "https://reference.yourdictionary.com/facts/25-soccer-facts-anyone-will-get-kick-out",
        "subCategory": "Soccer",
        "isSubCategory": true
    },
    {
        "id": 38,
        "title": "Ancient History",
        "category": "Ancient",
        "textInfo": "Ancient history is a time period from the beginning of writing and recorded human history to as far as late antiquity. The span of recorded history is roughly 5,000 years, beginning with the Sumerian cuneiform script. Ancient history covers all continents inhabited by humans in the period 3000 BCE – 500 CE. The three-age system periodizes ancient history into the Stone Age, the Bronze Age, and the Iron Age, with recorded history generally considered to begin with the Bronze Age. The start and end of the three ages varies between world regions. In many regions the Bronze Age is generally considered to begin a few centuries prior to 3000 BCE, while the end of the Iron Age varies from the early first millennium BCE in some regions to the late first millennium CE in others.\nDuring the time period of ancient history, the world population was already exponentially increasing due to the Neolithic Revolution, which was in full progress. While in 10,000 BCE, the world population stood at 2 million, it rose to 45 million by 3,000 BCE. By the Iron Age in 1000 BCE, the population had risen to 72 million. By the end of the ancient period in 500 CE, the world population is thought to have stood at 209 million. In 10,500 years, the world population increased by 100 times.\nPrehistory is the period before written history. Most of our knowledge of that period comes from the work of archaeologists. Prehistory is often known as the Stone Age, and is divided into the Paleolithic (earliest), Mesolithic, and Neolithic.\nThe early human migrations in the Lower Paleolithic saw Homo erectus spread across Eurasia 1.8 million years ago. Evidence for the use of fire has been dated as early as 1.8 million years ago, a date which is contested, with generally accepted evidence for the controlled use of fire dating to 780,000 years ago. Actual use of hearths first appears 400,000 years ago. Dates for the emergence of Homo sapiens (modern humans) range from 250,000 to 160,000 years ago, with the varying dates being based on DNA studies and fossils respectively. Some 50,000 years ago, Homo sapiens migrated out of Africa. They reached Australia about 45,000 years ago, southwestern Europe about the same time, southeastern Europe and Siberia around 40,000 years ago, and Japan about 30,000 years ago. Humans migrated to the Americas about 15,000 years ago.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 39,
        "title": "Ancient History of Southwest Asia",
        "category": "Ancient",
        "textInfo": "The ancient Near East is considered the cradle of civilisation. It was the first to practice intensive year-round agriculture; created one of the first coherent writing systems, invented the potter's wheel and then the vehicular wheel, created the first centralized governments, law codes and empires, as well as displaying social stratification, slavery, and organized warfare. It began the study of the stars and the sciences of astronomy and mathematics.\nMesopotamia is the site of some of the earliest known civilisations in the world. Agricultural communities emerged in the area with the Halaf culture around 8000 BCE and continued to expand through the Ubaid period around 6000 BCE. Cities began in the Uruk period (4000–3100 BCE) and expanded during the Jemdet Nasr (3100–2900 BCE) and Early Dynastic (2900–2350 BCE) periods. The surplus of storable foodstuffs created by this economy allowed the population to settle in one place instead of migrating after crops and herds. It also allowed for a much greater population density, and in turn required an extensive labour force and division of labour. This organization led to the necessity of record keeping and the development of writing.\nBabylonia was an Amorite state in lower Mesopotamia (modern southern Iraq), with Babylon as its capital. Babylonia emerged when Hammurabi created an empire out of the territories of the former kingdoms of Sumer and Akkad.\nAkkad was a city and its surrounding region near Babylon. Akkad also became the capital of the Akkadian Empire. Despite an extensive search, the precise site has never been found. Akkad reached the height of its power between about 2330 and 2150 BCE, following the conquests of King Sargon of Akkad. Through the spread of Sargon's empire, the language of Akkad, known as Akkadian from the city, spread and replaced the Sumerian language in Mesopotamia and eventually by 1450 BCE was the main language of diplomacy in the Near East.\nAssyria was originally a region on the Upper Tigris, where a small state was created in the 19th century BCE. The capital was at Assur, which gave the state its name. Later, as a nation and empire that came to control all of the Fertile Crescent, Egypt and much of Anatolia, the term Assyria proper referred to roughly the northern half of Mesopotamia (the southern half being Babylonia), with Nineveh as its capital. The Assyrian kings controlled a large kingdom at three different times in history. These are called the Old (20th to 18th centuries BCE), Middle (14th to 11th centuries BCE), and Neo-Assyrian (9th to 7th centuries BCE) kingdoms, or periods.\nMitanni was a Hurrian empire in northern Mesopotamia founded around 1500 BCE. The Mitanians conquered and controlled Assyria until the 14th century BCE while contending with Egypt for control of parts of modern Syria. Its capital was Washukanni, whose precise location has not been determined by archaeologists.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_southwest_asia.png?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 40,
        "title": "Ancient History of Afro-Asiatic Africa",
        "category": "Ancient",
        "textInfo": "Carthage was founded around 814 BC by Phoenician settlers. Ancient Carthage was a city-state that ruled an empire through alliances and trade influence that stretched throughout North Africa and modern Spain. At the height of the city's influence, its empire included most of the western Mediterranean. The empire was in a constant state of struggle with the Roman Republic, which led to a series of conflicts known as the Punic Wars. After the third and final Punic War, Carthage was destroyed then occupied by Roman forces. Nearly all of the territory held by Carthage fell into Roman hands.\nAncient Egypt was a long-lived civilisation geographically located in north-eastern Africa. It was concentrated along the middle to lower reaches of the Nile River, reaching its greatest extension during the 2nd millennium BC, which is referred to as the New Kingdom period. It reached broadly from the Nile Delta in the north, as far south as Jebel Barkal at the Fourth Cataract of the Nile. Extensions to the geographical range of ancient Egyptian civilisation included, at different times, areas of the southern Levant, the Eastern Desert and the Red Sea coastline, the Sinai Peninsula, and the Western Desert (focused on the several oases).\nThe Ta-Seti kingdom in Nubia to the south of Egypt was conquered by Egyptian rulers around 3100 BCE, but by 2500 BCE the Nubians had created a new kingdom further south, known as the Kingdom of Kush, centred on the upper Nile with a capital at Kerma. In the Egyptian New Kingdom period, Kush once more was conquered by Egypt, but by 1100 BCE a new kingdom of Kush had formed, with a capital at Napata. Nubian rulers conquered Egypt around 760 BCE and retained control for about a century.\nThe Axumite Empire was an important trading nation in northeastern Africa centered in present-day Eritrea and northern Ethiopia, it existed from approximately 100 to 940 CE, growing from the Iron Age proto-Aksumite period around the 4th century BCE to achieve prominence by the 1st century CE. The Empire of Aksum at its height at its climax by the early 6th-century CE extended through much of modern Ethiopia and across the Red Sea to Arabia. The capital city of the empire was Aksum, now in northern Ethiopia.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_afro_asiatic_africa.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 41,
        "title": "Ancient History of Niger-Congo Africa",
        "category": "Ancient",
        "textInfo": "The Nok culture appeared in Nigeria around 1000 BC and mysteriously vanished around 200 AD. The civilisation's social system is thought to have been highly advanced. The Nok civilisation was considered to be the earliest sub-Saharan producer of life-sized Terracotta which have been discovered by archaeologists. The Nok also used iron smelting that may have been independently developed.\nThe civilisation of Djenné-Djenno was located in the Niger River Valley in the country of Mali and is considered to be among the oldest urbanized centers and the best-known archaeology site in Sub-Saharan Africa. This archaeological site is located about 3 kilometers (1.9 mi) away from the modern town and is believed to have been involved in long-distance trade and possibly the domestication of African rice. The site is believed to exceed 33 hectares (82 acres); however, this is yet to be confirmed with extensive survey work. With the help of archaeological excavations mainly by Susan and Roderick McIntosh, the site is known to have been occupied from 250 BCE to 900 CE The city is believed to have been abandoned and moved where the current city is located due to the spread of Islam and the building of the Great Mosque of Djenné. Previously, it was assumed that advanced trade networks and complex societies did not exist in the region until the arrival of traders from Southwest Asia. However, sites such as Djenné-Djenno disprove this, as these traditions in West Africa flourished long before. Towns similar to that at Djenne-Jeno also developed at the site of Dia, also in Mali along the Niger River, from around 900 BCE.\nDhar Tichitt and Oualata were prominent among the early urban centres, dated to 2000 BCE, in present-day Mauritania. About 500 stone settlements littered the region in the former savannah of the Sahara. Its inhabitants fished and grew millet. It has been found that the Soninke of the Mandé peoples were responsible for constructing such settlements. Around 300 BCE, the region became more desiccated and the settlements began to decline, most likely relocating to Koumbi Saleh. From the type of architecture and pottery, it is believed that Tichit was related to the subsequent Ghana Empire. Old Jenne (Djenne) began to be settled around 300 BCE, producing iron and with sizeable population, evidenced in crowded cemeteries. The inhabitants and creators of these settlements during these periods thought to have been ancestors of the Soninke people.\nPeoples speaking precursors to the modern-day Bantu languages began to spread throughout southern Africa, and by 2000 BCE they were expanding past the Congo River and into the Great Lakes area and by 1000 CE these groups had spread throughout all of southern Africa south of the equator. Iron metallurgy and agriculture spread along with these peoples, with the cultivation of millet, oil palms, sorghum, and yams as well as the use of domesticated cattle, pigs, and sheep. These technologies helped increase population, and settled communities became common in sub-Saharan Africa except in deserts or heavy forests.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_niger_congo_africa.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 42,
        "title": "Ancient History of South Asia",
        "category": "Ancient",
        "textInfo": "Paleolithic tools have been discovered in India dating to 200,000 years ago, and neolithic sites are known from near the Indus Valley dating to around 8000 BCE. Agriculture began in the Indus Valley around 7000 BCE, and to the Ganges Valley by 3000 BCE. Barley, cotton, and wheat were grown and the population had domesticated cattle, goats, and sheep.\nThe Indus Valley civilization developed around 3000 BCE in the Indus and Ghaggar-Hakra river valleys of eastern Afghanistan, Pakistan, and western India. Another name for this civilisation is Harappan, after the first of its cities to be excavated, Harappa in the Pakistani province of Punjab. Harappan civilization grew out of the earlier agricultural communities as they evolved into cities. These communities created and traded jewelry, figurines, and seals that appear widely scattered throughout Mesopotamia, Afghanistan, and Iran. Chickens were domesticated in addition to the earlier crops and animals. They developed their own writing system, the Indus Valley script, which is still mostly undeciphered. The exact structure of society and the way the cities were governed is not known. By about 1600 BCE, the Indus Valley culture had abandoned many of their cities, including Mohenjo-Daro. The exact reason for this decline is not known.\nIndo-European speaking peoples began to spread into India about 1500 BCE. The Rigveda, in Sanskrit, dates to this period and begins a period often known as the Vedic period. Between 1500 and 500 BCE these peoples spread throughout most of India and had begun to found small cities. Vedic society was characterized by the varna system which divided society into four broad castes, which were later elaborated. By the end of the Vedic period, this way of organizing society had become central to Indian society. Religion in the late Vedic period was evolving into Hinduism, which spread throughout Southeast Asia. Siddhartha Gautama, born around 560 BCE in northern India, went on to found a new religion based on his ascetic life – Buddhism. This faith also spread throughout Eastern and Southeastern Asia after his death. This period also saw the composition of the epics Ramayana and Mahabharata.\nThe kingdom of Magadha rose to prominence under a number of dynasties that peaked in power under the reign of Ashoka Maurya, one of India's most legendary and famous emperors. During the reign of Ashoka, the four dynasties of Chola, Chera, and Pandya were ruling in the South, while Devanampiya Tissa (250–210 BCE) controlled Anuradhapura (now Sri Lanka). These kingdoms, while not part of Ashoka's empire, were in friendly terms with the Maurya Empire. An alliance existed between Devanampiya Tissa and Ashoka of India, who sent Buddhist missionaries to Sri Lanka.\nMost of North India was reunited under the Gupta Empire beginning under Chandragupta I around 320 CE. Under his successors the empire spread to include much of India except for the Deccan Plateau and the very south of the peninsula. This was a period of relative peace, and the Gupta rulers generally left administration in local rulers. The Gupta Empire was weakened and ultimately ruined by the raids of Hunas (a branch of the Hephthalites emanating from Central Asia), and the empire broke up into smaller regional kingdoms by the end of the fifth century CE. India would remain fragmented into smaller states until the rise of the Mughal Empire in the 1500s.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_south_asia.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 43,
        "title": "Ancient History of East Asia",
        "category": "Ancient",
        "textInfo": "The Chinese civilisation that emerged within the Yellow River valley is one of earliest civilisations in the world. Prior to the formation of civilisation, neolithic cultures such as the Longshan and Yangshao dating to 5000 BCE produced sophisticated pottery, cultivated millet, and likely produced clothes woven from hemp and silk.Rice was also farmed and pigs and water buffalo were kept for food. Longshan potters may have used the pottery wheel to produce their wares. Ancient Chinese traditions described three ancient dynasties that predated the unification under the Qin and Han dynasties. These were the Xia, the Shang, and the Zhou. It wasn't until the later 20th century that many historians considered the Shang or Xia to be anything other than legendary. Little is yet known about the Xia, which appears to have begun around 2200 BCE, and may have controlled parts of the Yangtze River valley.\nThe Shang dynasty traditionally is dated to 1766 to 1122 BCE. Bronze was central to Shang culture and technology, with chariots and bronze weapons helping to expand Shang control over northern China. The cities at Ao and Yinxu, near Anyang, have been excavated and city walls, royal palaces, and archives as well as tombs and workshops were found. A system of writing developed, beginning with oracle bones, of which over 100,000 are still extant.\nTowards the end of the 2nd millennium BCE, the Shang were overrun by the Zhou dynasty from the Wei River valley to the west. The Zhou rulers at this time invoked the concept of the Mandate of Heaven to legitimize their rule, a concept that would be influential for almost every successive dynasty. The Zhou initially established their capital in the west near modern Xi'an, near the Yellow River, but they would preside over a series of expansions into the Yangtze River valley. Zhou administration was decentralised, with local elites responsible for collecting tribute and providing military support to the Zhou rulers.\nAfter further political consolidation, seven prominent states remained by the end of the 5th century BC, and the years in which these few states battled each other is known as the Warring States period. Though there remained a nominal Zhou king until 256 BCE, he was largely a figurehead and held little power. As neighboring territories of these warring states, including areas of modern Sichuan and Liaoning, were annexed by the growing power of the rulers of Qin, they were governed under the new local administrative system of commandery. The final expansion in this period began during the reign of Ying Zheng, the king of Qin. His unification of the other six powers, and further annexations to the south and southeast by 213 BCE enabled him to proclaim himself the First Emperor (Qin Shi Huangdi).",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_east_asia.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 44,
        "title": "Ancient History of The Americas",
        "category": "Ancient",
        "textInfo": "In pre-Columbian times, several large, centralized ancient civilisations developed in the Western Hemisphere, both in Mesoamerica and western South America. Beyond these areas, the use of agriculture expanded East of the Andes Mountains in South America particularly with the Marajoara culture, and in the continental United States.\nAncient Andean civilisation began with the rise of organized fishing communities from 3500 BCE onwards. Along with a sophisticated maritime society came the construction of large monuments, which likely existed as community centers. The peoples of this area grew beans, cotton, peanuts, and sweet potatoes, fished in the ocean, and by about 2000 BCE had added the potato to their crops. The Chavin culture, based around the Chavin cult, emerged around 1000 BCE and led to large temples and artworks as well sophisticated textiles. Gold, silver, and copper were worked for jewelry and occasionally for small copper tools.\nAfter the decline of Chavin culture, a number of cities formed after about 200 BCE. The cities at Huari, Pucara, and Tiahuanaco were all likely over 10,000 residents. From about 300 CE, the Mochica culture arose along the Moche River. These people left painted pottery depicting their society and culture with a wide range of varied subjects. Besides the Mochica, there were a number of other large states in the Andes after about 100 CE. Included amongst these are the Nazca culture, who were mainly village-dwelling but left behind a large ceremonial centre at Cahuachi as well as the Nazca lines, a large number of huge designs set into the desert floor.\nAgricultural cultivation began around 8000 BCE in Mesoamerica, where avocados, beans, chili peppers, gourds, and squashes were grown from about 7000 BCE. Around 4000 BCE maize began to be grown, and soon after this tomatoes. Settlements appeared around 3000 BCE and by 2000 BCE most of Mesoamerica was practicing agriculture. Although some animals were domesticated — notably turkeys and dogs — the lack of suitable large animals precluded the development of animals used for transportation or labour.\nAround 1200 BCE the first Olmec center of San Lorenzo was founded, which remained the centre of Olmec civilisation until around 800 BCE when La Venta took over before losing primacy to Tres Zapotes around 400 BCE. These and other Olmec centres were groups of tombs, temples, and other ceremonial sites built of stone. Their construction testifies to the complexity of Olmec society, although the exact nature of how they were governed is not known. They also erected large stone sculptures of human heads and other subjects. Jade jewelry and other Olmec objects are found throughout Mesoamerica, likely having travelled via trade networks. The Olmec writing system was mainly used for recording their calendar, both of which influenced later Mesoamericam cultures.\nOrganized societies, in the ancient United States or Canada, were often mound builder civilisations. One of the most significant of these was the Poverty Point culture that existed in the U.S. state of Louisiana, and was responsible for the creation of over 100 mound sites. The Mississippi River was a core area in the development of long-distance trade and culture. Following Poverty Point, successive complex cultures such as the Hopewell emerged in the Southeastern United States in the Early Woodland period. Before 500 CE many mound builder societies retained a hunter gatherer form of subsistence.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_the_americas.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 45,
        "title": "Ancient History of Europe",
        "category": "Ancient",
        "textInfo": "Minoan civilisation emerged around 3000 BCE on the island of Crete, where towns emerged on the coast. Trade was important in Minoan civilisation, with artifacts from the Minoans discovered in Egypt, Syria, Cyprus, and Greece. Large palaces grew up on Crete, decorated with painted frescoes. A Minoan writing system is known - Linear A, but it remains mostly undeciphered. An eruption of a volcano on the island of Thera around 1500 BCE may have contributed to the decline of Minoan civilisation, with many of the Cretan cities being destroyed around 1450 BCE by Mycenaean from mainland Greece. Unlike Linear A, the Mycenaean writing system - Linear B - has been deciphered. Mycenaean culture flourished until around 1200 BCE, when it too declined and many of its centres were destroyed.\nThe Classical Greek world was dominated throughout the 5th century BCE by the major powers of Athens and Sparta. Through the Delian League, Athens was able to convert pan-hellenist sentiment and fear of the Persian threat into a powerful empire, and this, along with the conflict between Sparta and Athens culminating in the Peloponnesian War, was the major political development of the first part of the Classical period. The period in Greek history from the death of Alexander the Great until the rise of the Roman empire and its conquest of Egypt in 30 BCE is known as the Hellenistic period. After Alexander's death, a series of wars between his successors eventually led to three large states being formed parts of Alexander's conquests, each ruled by a dynasty founded by one of the successors. These were the Antigonids, the Selucids, and the Ptolemies. These three kingdoms, along with smaller kingdoms, spread Greek culture and lifestyles into Asia and Egypt. These varying states eventually were conquered by Rome or the Parthian Empire.\nAncient Rome was a civilisation that grew out of the city-state of Rome, originating as a small agricultural community founded on the Italian peninsula in 8th century BCE, with influences from Greece and other Italian civilisations, such as the Etruscans. Traditionally Rome was founded as a monarchy that then became a republic. Rome expanded through the Italian peninsula through a series of wars in the fifth through the third centuries BCE. This expansion brought the Roman republic into conflict with Carthage, leading to a series of Punic Wars, that ended with the destruction of Carthage in 146 BCE. Rome then expanded into Greece and the eastern Mediterranean, while a series of internal conflicts led to the republic becoming an empire ruled by an emperor by the first century CE. Throughout the first and second centuries CE, the Empire grew slightly while spreading Roman culture throughout its boundaries.\nThe Roman Empire underwent considerable social, cultural and organizational change starting with reign of Diocletian, who began the custom of splitting the empire into eastern and western halves ruled by multiple emperors. Constantine the Great began the process of Christianizing the empire and established a new capital at Constantinople. Migrations of Germanic tribes disrupted Roman rule from the late 4th century onwards, culminating in the eventual collapse of the empire in the West in 476, replaced by the so-called barbarian kingdoms. The resultant cultural fusion of Greco-Roman, Germanic and Christian traditions formed the cultural foundations of Europe. There has been attempt by scholars to connect European late antiquity to other areas in Eurasia.\nThe Celts were a diverse group of tribal societies in Iron Age Europe. Proto-Celtic culture formed in the Early Iron Age in Central Europe (Hallstatt period, named for the site in present-day Austria). By the later Iron Age (La Tène period), Celts had expanded over wide range of lands: as far west as Ireland and the Iberian Peninsula, as far east as Galatia (central Anatolia), and as far north as Scotland. By the early centuries CE, following the expansion of the Roman Empire and the Great Migrations of Germanic peoples, Celtic culture had become restricted to the British Isles.\nThe Huns were a nomadic people who formed a large state in Eastern Europe by about 400 CE, and under their leader Attila, they fought against both sections of the Roman Empire. However, after Attila's death, the state feel apart and the Huns influence in history disappeared.The Hun-Xiongnu connection is controversial at best and is often disputed but is also not completely discredited.\nMigration of Germanic peoples to Britain from what is now northern Germany and southern Scandinavia is attested from the 5th century. Groups of Goths migrated into western Europe, with the Ostrogoths eventually settling in Italy before being conquered by the Lombards.A related people, the Visigoths settled in Spain, founding a kingdom that lasted until it was conquered by Islamic rulers in the 700s CE.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/ancient_history_of_europe.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Ancient_history",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 46,
        "title": "History of Archaeology",
        "category": "Sites",
        "textInfo": "Archaeology is the study of human activity in the past, primarily through the recovery and analysis of the material culture and environmental data that they have left behind, which includes artifacts, architecture, biofacts (also known as eco-facts) and cultural landscapes (the archaeological record).\nThe development of the field of archaeology has it roots with history and with those who were interested in the past, such as kings and queens who wanted to show past glories of their respective nations. In the 6th century BC, Nabonidus of the Neo-Babylonian Empire excavated, surveyed and restored sites built more than a millennium earlier under Naram-sin of Akkad. The 5th-century-BCE Greek historian Herodotus was the first scholar to systematically study the past and also an early examiner of artifacts. In Medieval India, the study of past was recorded. In the Song Empire (960–1279) of Imperial China, Chinese scholar-officials unearthed, studied, and cataloged ancient artifacts, a native practice that continued into the Qing dynasty (1644–1912) before adoption of Western methods. The 15th and 16th centuries saw the rise of antiquarians in Renaissance Europe such as Flavio Biondo who were interested in the collection of artifacts. The antiquarian movement shifted into nationalism as personal collections turned into national museums. It evolved into a much more systematic discipline in the late 19th century and became a widely used tool for historical and anthropological research in the 20th century. During this time there were also significant advances in the technology used in the field.\nThe OED first cites archaeologist from 1824; this soon took over as the usual term for one major branch of antiquarian activity. Archaeology, from 1607 onwards, initially meant what we would call ancient history generally, with the narrower modern sense first seen in 1837.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_archaeology.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/History_of_archaeology",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 47,
        "title": "History of Stonehenge",
        "category": "Sites",
        "textInfo": "Stonehenge is a prehistoric monument on Salisbury Plain in Wiltshire, England, two miles (3 km) west of Amesbury. It consists of an outer ring of vertical sarsen standing stones, each around 13 feet (4.0 m) high, seven feet (2.1 m) wide, and weighing around 25 tons, topped by connecting horizontal lintel stones. Inside is a ring of smaller bluestones. Inside these are free-standing trilithons, two bulkier vertical sarsens joined by one lintel. The whole monument, now ruinous, is aligned towards the sunrise on the summer solstice. The stones are set within earthworks in the middle of the densest complex of Neolithic and Bronze Age monuments in England, including several hundred tumuli (burial mounds).\nArchaeologists believe that Stonehenge was constructed from 3000 BC to 2000 BC. The surrounding circular earth bank and ditch, which constitute the earliest phase of the monument, have been dated to about 3100 BC. Radiocarbon dating suggests that the first bluestones were raised between 2400 and 2200 BC, although they may have been at the site as early as 3000 BC.\nOne of the most famous landmarks in the United Kingdom, Stonehenge is regarded as a British cultural icon. It has been a legally protected scheduled monument since 1882, when legislation to protect historic monuments was first successfully introduced in Britain. The site and its surroundings were added to UNESCO's list of World Heritage Sites in 1986. Stonehenge is owned by the Crown and managed by English Heritage; the surrounding land is owned by the National Trust.\nStonehenge evolved in several construction phases spanning at least 1500 years. There is evidence of large-scale construction on and around the monument that perhaps extends the landscape's time frame to 6500 years. Dating and understanding the various phases of activity are complicated by disturbance of the natural chalk by periglacial effects and animal burrowing, poor quality early excavation records, and a lack of accurate, scientifically verified dates. The modern phasing most generally agreed to by archaeologists is detailed below. Features mentioned in the text are numbered and shown on the plan, right.\nThe first monument consisted of a circular bank and ditch enclosure made of Late Cretaceous (Santonian Age) Seaford chalk, measuring about 360 feet (110 m) in diameter, with a large entrance to the north east and a smaller one to the south. It stood in open grassland on a slightly sloping spot. The builders placed the bones of deer and oxen in the bottom of the ditch, as well as some worked flint tools. The bones were considerably older than the antler picks used to dig the ditch, and the people who buried them had looked after them for some time prior to burial. The ditch was continuous but had been dug in sections, like the ditches of the earlier causewayed enclosures in the area. The chalk dug from the ditch was piled up to form the bank. This first stage is dated to around 3100 BC, after which the ditch began to silt up naturally. Within the outer edge of the enclosed area is a circle of 56 pits, each about 3.3 feet (1 m) in diameter, known as the Aubrey holes after John Aubrey, the seventeenth-century antiquarian who was thought to have first identified them. These pits and the bank and ditch together are known as the Palisade or Gate Ditch. The pits may have contained standing timbers creating a timber circle, although there is no excavated evidence of them. A recent excavation has suggested that the Aubrey Holes may have originally been used to erect a bluestone circle. If this were the case, it would advance the earliest known stone structure at the monument by some 500 years.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_stonehenge.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Stonehenge",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 48,
        "title": "History of Great Wall of China",
        "category": "Sites",
        "textInfo": "The Great Wall of China is a series of fortifications that were built across the historical northern borders of ancient Chinese states and Imperial China as protection against various nomadic groups from the Eurasian Steppe. Several walls were built from as early as the 7th century BC, with selective stretches later joined by Qin Shi Huang (220–206 BC), the first emperor of China. Little of the Qin wall remains. Later on, many successive dynasties built and maintained multiple stretches of border walls. The best-known sections of the wall were built by the Ming dynasty (1368–1644).\nThe Chinese were already familiar with the techniques of wall-building by the time of the Spring and Autumn period between the 8th and 5th centuries BC. During this time and the subsequent Warring States period, the states of Qin, Wei, Zhao, Qi, Han, Yan, and Zhongshan all constructed extensive fortifications to defend their own borders. Built to withstand the attack of small arms such as swords and spears, these walls were made mostly of stone or by stamping earth and gravel between board frames.\nKing Zheng of Qin conquered the last of his opponents and unified China as the First Emperor of the Qin dynasty (Qin Shi Huang) in 221 BC. Intending to impose centralized rule and prevent the resurgence of feudal lords, he ordered the destruction of the sections of the walls that divided his empire among the former states. To position the empire against the Xiongnu people from the north, however, he ordered the building of new walls to connect the remaining fortifications along the empire's northern frontier. Build and move on was a central guiding principle in constructing the wall, implying that the Chinese were not erecting a permanently fixed border.\nThe Great Wall concept was revived again under the Ming in the 14th century, and following the Ming army's defeat by the Oirats in the Battle of Tumu. The Ming had failed to gain a clear upper hand over the Mongol tribes after successive battles, and the long-drawn conflict was taking a toll on the empire. The Ming adopted a new strategy to keep the nomadic tribes out by constructing walls along the northern border of China. Acknowledging the Mongol control established in the Ordos Desert, the wall followed the desert's southern edge instead of incorporating the bend of the Yellow River.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_great_wall_of_china.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Great_Wall_of_China",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 49,
        "title": "History of Great Sphinx of Giza",
        "category": "Sites",
        "textInfo": "The Great Sphinx of Giza is a limestone statue of a reclining sphinx, a mythical creature with the head of a human, and the body of a lion. Facing directly from west to east, it stands on the Giza Plateau on the west bank of the Nile in Giza, Egypt. The face of the Sphinx appears to represent the pharaoh Khafre.\nThe original shape of the Sphinx was cut from the bedrock, and has since been restored with layers of limestone blocks. It measures 73 m (240 ft) long from paw to tail, 20 m (66 ft) high from the base to the top of the head and 19 m (62 ft) wide at its rear haunches. Its nose was broken off for unknown reasons between the 3rd and 10th centuries AD.\nThe Sphinx is the oldest known monumental sculpture in Egypt and one of the most recognisable statues in the world. The archaeological evidence suggests that it was created by ancient Egyptians of the Old Kingdom during the reign of Khafre (c. 2558–2532 BC).\nThe archaeological evidence suggests that the Great Sphinx was created around 2500 BC for the pharaoh Khafre, the builder of the Second Pyramid at Giza. The Sphinx is a monolith carved from the bedrock of the plateau, which also served as the quarry for the pyramids and other monuments in the area. Egyptian geologist Farouk El-Baz has suggested that the head of the Sphinx may have been carved first, out of a natural yardang, i.e. a ridge of bedrock that had been sculpted by the wind. These can sometimes achieve shapes which resemble animals. El-Baz suggests that the moat or ditch around the Sphinx may have been quarried out later to allow for the creation of the full body of the sculpture.\nSome time around the First Intermediate Period, the Giza Necropolis was abandoned, and drifting sand eventually buried the Sphinx up to its shoulders. The first documented attempt at an excavation dates to c. 1400 BC, when the young Thutmose IV (1401–1391 or 1397–1388 BC) gathered a team and, after much effort, managed to dig out the front paws, between which he erected a shrine that housed the Dream Stele, an inscribed granite slab (possibly a repurposed door lintel from one of Khafre's temples).\nSome ancient non-Egyptians saw it as a likeness of the god Horon. The cult of the Sphinx continued into medieval times. The Sabians of Harran saw it as the burial place of Hermes Trismegistus. Arab authors described the Sphinx as a talisman which guarded the area from the desert. Al-Maqrizi describes it as the talisman of the Nile of which the locals believed the flood cycle depended upon. Muhammad al-Idrisi stated that those wishing to obtain bureaucratic positions in the Egyptian government gave incense offering to the monument.
",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_great_sphinx_of_giza.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Great_Sphinx_of_Giza",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 50,
        "title": "History of The Acropolis of Athens",
        "category": "Sites",
        "textInfo": "The Acropolis of Athens is an ancient citadel located on a rocky outcrop above the city of Athens and contains the remains of several ancient buildings of great architectural and historical significance, the most famous being the Parthenon. The word acropolis is from the Greek words ἄκρον (akron, highest point, extremity) and πόλις (polis, city). The term acropolis is generic and there are many other acropoleis in Greece. During ancient times the Acropolis of Athens was known also more properly as Cecropia, after the legendary serpent-man, Cecrops, the supposed first Athenian king.\nThe Acropolis is located on a flattish-topped rock that rises 150 m (490 ft) above sea level in the city of Athens, with a surface area of about 3 hectares (7.4 acres). While the earliest artifacts date to the Middle Neolithic era, there have been documented habitations in Attica from the Early Neolithic period (6th millennium BC).\nNot much is known about the architectural appearance of the Acropolis until the Archaic era. During the 7th and the 6th centuries BC, the site was controlled by Kylon during the failed Kylonian revolt, and twice by Peisistratos; each of these were attempts directed at seizing political power by coups d'état. Apart from the Hekatompedon mentioned later, Peisistratos also built an entry gate or propylaea. Nevertheless, it seems that a nine-gate wall, the Enneapylon, had been built around the acropolis hill and incorporating the biggest water spring, the Clepsydra, at the northwestern foot.\nA temple to Athena Polias, the tutelary deity of the city, was erected between 570 and 550 BC. This Doric limestone building, from which many relics survive, is referred to as the Hekatompedon (Greek for hundred–footed), Ur-Parthenon (German for original Parthenon or primitive Parthenon), H–Architecture or Bluebeard temple, after the pedimental three-bodied man-serpent sculpture, whose beards were painted dark blue. Whether this temple replaced an older one, or just a sacred precinct or altar, is not known. Probably, the Hekatompedon was built where the Parthenon now stands.\nDuring the Hellenistic and Roman periods, many of the existing buildings in the area of the Acropolis were repaired, due to damage from age, and occasionally, war. Monuments to foreign kings were erected, notably those of the Attalid kings of Pergamon Attalos II (in front of the NW corner of the Parthenon), and Eumenes II, in front of the Propylaia. These were rededicated during the early Roman Empire to Augustus or Claudius (uncertain), and Agrippa, respectively. Eumenes was also responsible for constructing a stoa on the South slope, not unlike that of Attalos in the Agora below.\nDuring the Byzantine period, the Parthenon was used as a church, dedicated to the Virgin Mary. During the Latin Duchy of Athens, the Acropolis functioned as the city's administrative center, with the Parthenon as its cathedral, and the Propylaea as part of the Ducal Palace. A large tower was added, the Frankopyrgos, demolished during the 19th century.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_the_acropolis_of_athens.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Acropolis_of_Athens",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 51,
        "title": "History of The Colosseum",
        "category": "Sites",
        "textInfo": "The Colosseum is an oval amphitheatre in the centre of the city of Rome, Italy, just east of the Roman Forum. It is the largest ancient amphitheatre ever built, and is still the largest standing amphitheatre in the world today, despite its age. Construction began under the emperor Vespasian (r. 69–79 AD) in 72 and was completed in 80 AD under his successor and heir, Further modifications were made during the reign of Domitian (r. 81–96). The three emperors that were patrons of the work are known as the Flavian dynasty, and the amphitheatre was named the Flavian Amphitheatre  by later classicists and archaeologists for its association with their family name (Flavius).\nThe Colosseum is built of travertine limestone, tuff (volcanic rock), and brick-faced concrete. It could hold an estimated 50,000 to 80,000 spectators at various points in its history, having an average audience of some 65,000; it was used for gladiatorial contests and public spectacles including animal hunts, executions, re-enactments of famous battles, and dramas based on Roman mythology, and briefly mock sea battles. The building ceased to be used for entertainment in the early medieval era. It was later reused for such purposes as housing, workshops, quarters for a religious order, a fortress, a quarry, and a Christian shrine.\nThe site chosen was a flat area on the floor of a low valley between the Caelian, Esquiline and Palatine Hills, through which a canalised stream ran as well as an artificial lake/marsh. By the 2nd century BC the area was densely inhabited. It was devastated by the Great Fire of Rome in 64 AD, following which Nero seized much of the area to add to his personal domain. He built the grandiose Domus Aurea on the site, in front of which he created an artificial lake surrounded by pavilions, gardens and porticoes. The existing Aqua Claudia aqueduct was extended to supply water to the area and the gigantic bronze Colossus of Nero was set up nearby at the entrance to the Domus Aurea.\nConstruction of the Colosseum began under the rule of Vespasian in around 70–72 AD (73–75 AD according to some sources). The Colosseum had been completed up to the third story by the time of Vespasian's death in 79. The top level was finished by his son, Titus, in 80, and the inaugural games were held in 80 or 81 AD. Dio Cassius recounts that over 9,000 wild animals were killed during the inaugural games of the amphitheatre. Commemorative coinage was issued celebrating the inauguration. The building was remodelled further under Vespasian's younger son, the newly designated Emperor Domitian, who constructed the hypogeum, a series of tunnels used to house animals and slaves. He also added a gallery to the top of the Colosseum to increase its seating capacity.\nIn 217, the Colosseum was badly damaged by a major fire (caused by lightning, according to Dio Cassius), which destroyed the wooden upper levels of the amphitheatre's interior. It was not fully repaired until about 240 and underwent further repairs in 250 or 252 and again in 320. Honorius banned the practice of gladiator fights in 399 and again in 404. Gladiatorial fights are last mentioned around 435. An inscription records the restoration of various parts of the Colosseum under Theodosius II and Valentinian III (reigned 425–455), possibly to repair damage caused by a major earthquake in 443; more work followed in 484 and 508. The arena continued to be used for contests well into the 6th century. Animal hunts continued until at least 523, when Anicius Maximus celebrated his consulship with some venationes, criticised by King Theodoric the Great for their high cost.\nThe Colosseum underwent several radical changes of use. By the late 6th century a small chapel had been built into the structure of the amphitheater, though this apparently did not confer any particular religious significance on the building as a whole. The arena was converted into a cemetery. The numerous vaulted spaces in the arcades under the seating were converted into housing and workshops, and are recorded as still being rented out as late as the 12th century. Around 1200 the Frangipani family took over the Colosseum and fortified it, apparently using it as a castle. In the early to mid 14th century, the Pope's relocation to Avignon caused a population decline in Rome that left the region insecure. The colosseum was largely abandoned by the public and became a popular den for bandits.\nDuring the 16th and 17th century, Church officials sought a productive role for the Colosseum. Pope Sixtus V (1585–1590) planned to turn the building into a wool factory to provide employment for Rome's prostitutes, though this proposal fell through with his premature death. In 1671 Cardinal Altieri authorized its use for bullfights; a public outcry caused the idea to be hastily abandoned.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_colosseum.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Colosseum",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 52,
        "title": "History of Machu Picchu",
        "category": "Sites",
        "textInfo": "Machu Picchu is a 15th-century Inca citadel located in the Eastern Cordillera of southern Peru on a 2,430-meter (7,970 ft) mountain range. It is located in the Machupicchu District within Urubamba Province above the Sacred Valley, which is 80 kilometers (50 mi) northwest of Cusco. The Urubamba River flows past it, cutting through the Cordillera and creating a canyon with a tropical mountain climate.\nMost recent archaeologists believe that Machu Picchu was constructed as an estate for the Inca emperor Pachacuti (1438–1472). Often referred to as the Lost City of the Incas, it is the most familiar icon of Inca civilization. The Incas built the estate around 1450 but abandoned it a century later, at the time of the Spanish conquest. According to the new AMS radiocarbon dating, it was occupied from c. 1420–1532. Historical research published in 2022 claims that the site was probably called Huayna Picchu by the Inca, as it exists on the smaller peak of the same name.\nMachu Picchu was built in the classical Inca style, with polished dry-stone walls. Its three primary structures are the Intihuatana, the Temple of the Sun, and the Room of the Three Windows. Most of the outlying buildings have been reconstructed in order to give visitors a better idea of how they originally appeared. By 1976, 30% of Machu Picchu had been restored and restoration continues.\nMachu Picchu was believed (by Richard L. Burger, professor of anthropology at Yale University) to have been built in the 1450s. However, a 2021 study led by Burger used radiocarbon dating (specifically, AMS) to reveal that Machu Picchu may have been occupied from around 1420–1530 AD. Construction appears to date from two great Inca rulers, Pachacutec Inca Yupanqui (1438–1471) and Túpac Inca Yupanqui (1472–1493).  There is a consensus among archeologists that Pachacutec ordered the construction of the royal estate for his use as a retreat, most likely after a successful military campaign. Although Machu Picchu is considered to be a royal estate, it would not have been passed down in the line of succession. Rather it was used for 80 years before being abandoned, seemingly because of the Spanish conquests in other parts of the Inca Empire. It is possible that most of its inhabitants died from smallpox introduced by travelers before the Spanish conquistadors arrived in the area.\nDuring its use as a royal estate, it is estimated that about 750 people lived there, with most serving as support staff (yanaconas, yana) who lived there permanently. Though the estate belonged to Pachacutec, religious specialists and temporary specialized workers (mayocs) lived there as well, most likely for the ruler's well-being and enjoyment. During the harsher season, staff dropped down to around a hundred servants and a few religious specialists focused on maintenance alone.\nMuch of the farming done at Machu Picchu was done on its hundreds of man-made terraces. These terraces were a work of considerable engineering, built to ensure good drainage and soil fertility while also protecting the mountain itself from erosion and landslides. However, the terraces were not perfect, as studies of the land show that there were landslides that happened during the construction of Machu Picchu. Still visible are places where the terraces were shifted by landslides and then stabilized by the Inca as they continued to build around the area. Terraces constructed overlooking Urubamba River and many other springs provided fresh water for crop production and served more than 1,000 households.\nIn the late 1500s, Spaniards who recently gained control of the area documented that indigenous individuals mentioned returning to Huayna Picchu, the name that is believed to be originally given to the site by locals. The Spanish conquistador Baltasar de Ocampo had notes of a visit during the end of the 16th century to a mountain fortress called Pitcos with very sumptuous and majestic buildings, erected with great skill and art, all the lintels of the doors, as well the principal as the ordinary ones, being of marble, elaborately carved.\nBingham was a lecturer at Yale University, although not a trained archeologist. In 1909, returning from the Pan-American Scientific Congress in Santiago, he travelled through Peru and was invited to explore the Inca ruins at Choqquequirau in the Apurímac Valley. He organized the 1911 Yale Peruvian Expedition in part to search for the Inca capital, which was thought to be the city of Vitcos. He consulted Carlos Romero, one of the chief historians in Lima who showed him helpful references and Father Antonio de la Calancha’s Chronicle of the Augustinians. In particular, Ramos thought Vitcos was near a great white rock over a spring of fresh water. Back in Cusco again, Bingham asked planters about the places mentioned by Calancha, particularly along the Urubamba River. According to Bingham, one old prospector said there were interesting ruins at Machu Picchu, though his statements were given no importance by the leading citizens. Only later did Bingham learn that Charles Wiener also heard of the ruins at Huayna Picchu and Machu Picchu, but was unable to reach them.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_machu_picchu.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Machu_Picchu",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 53,
        "title": "History of Pompeii",
        "category": "Sites",
        "textInfo": "Pompeii was an ancient city located in what is now the comune of Pompei near Naples in the Campania region of Italy. Pompeii, along with Herculaneum and many villas in the surrounding area (e.g. at Boscoreale, Stabiae), was buried under 4 to 6 m (13 to 20 ft) of volcanic ash and pumice in the Eruption of Mount Vesuvius in 79 AD.\nThe first stable settlements on the site date back to the 8th century BC when the Oscans, a population of central Italy, founded five villages in the area.\nWith the arrival of the Greeks in Campania from around 740 BC, Pompeii entered the orbit of the Hellenic people. The most important building of this period is the Doric Temple, built away from the centre in what would later become the Triangular Forum. At the same time the cult of Apollo was introduced. Greek and Phoenician sailors used the location as a safe port.\nThe period between about 450–375 BC witnessed large areas of the city being abandoned while important sanctuaries such as the Temple of Apollo show a sudden lack of votive material remains.\nThe Samnites, people from the areas of Abruzzo and Molise, and allies of the Romans, conquered Greek Cumae between 423 and 420 BC. It is likely that all the surrounding territory, including Pompeii, was already conquered around 424 BC. The new rulers gradually imposed their architecture and enlarged the town.\nFrom 343 to 341 BC in the Samnite Wars, the first Roman army entered the Campanian plain bringing with it the customs and traditions of Rome, and in the Roman Latin War from 340 BC, the Samnites were faithful to Rome. Although governed by the Samnites, Pompeii entered the Roman orbit, to which it remained faithful even during the third Samnite war and in the war against Pyrrhus. In the late 4th century BC, the city began expanding from its nucleus into the open-walled area. The street plan of the new areas was more regular and more conformal to Hippodamus's street plan. The city walls were reinforced in Sarno stone in the early 3rd century BC (the limestone enceinte, or the first Samnite wall). It formed the basis for the currently visible walls with an outer wall of rectangular limestone blocks as a terrace wall supporting a large agger, or earth embankment, behind it.\nPompeii was one of the towns of Campania that rebelled against Rome in the Social Wars and in 89 BC it was besieged by Sulla, who targeted the strategically vulnerable Porta Ercolano with his artillery as can still be seen by the impact craters of thousands of ballista shots in the walls. Many nearby buildings inside the walls were also destroyed. Although the battle-hardened troops of the Social League, headed by Lucius Cluentius, helped in resisting the Romans, Pompeii was forced to surrender after the conquest of Nola. The result was that Pompeii became a Roman colony named Colonia Cornelia Veneria Pompeianorum. Many of Sulla's veterans were given land and property in and around the city, while many who opposed Rome were dispossessed of their property. Despite this, the Pompeians were granted Roman citizenship and quickly assimilated into the Roman world. The main language in the city became Latin, and many of Pompeii's old aristocratic families Latinized their names as a sign of assimilation.\nThe eruption lasted for two days. The first phase was of pumice rain (lapilli) lasting about 18 hours, allowing most inhabitants to escape. Only approximately 1,150 bodies have so far been found on site seems to confirm this theory and most escapees probably managed to salvage some of their most valuable belongings; many skeletons were found with jewellery, coins and silverware.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_pompeii.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Pompeii",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 54,
        "title": "History of Mohenjo-daro",
        "category": "Sites",
        "textInfo": "Mohenjo-daro was built in the 26th century BCE. It was one of the largest cities of the ancient Indus Valley Civilization, also known as the Harappan Civilization, which developed around 3,000 BCE from the prehistoric Indus culture. At its height, the Indus Civilization spanned much of what is now Pakistan and North India, extending westwards to the Iranian border, south to Gujarat in India and northwards to an outpost in Bactria, with major urban centers at Harappa, Mohenjo-daro, Lothal, Kalibangan, Dholavira and Rakhigarhi. Mohenjo-daro was the most advanced city of its time, with remarkably sophisticated civil engineering and urban planning. When the Indus civilization went into sudden decline around 1900 BCE, Mohenjo-daro was abandoned.\nThe ruins of the city remained undocumented for around 3,700 years until R. D. Banerji, an officer of the Archaeological Survey of India, visited the site in 1919–20 identifying what he thought to be a Buddhist stupa (150–500 CE) known to be there and finding a flint scraper which convinced him of the site's antiquity. This led to large-scale excavations of Mohenjo-daro led by K. N. Dikshit in 1924–25, and John Marshall in 1925–26. In the 1930s major excavations were conducted at the site under the leadership of Marshall, D. K. Dikshitar and Ernest Mackay. Further excavations were carried out in 1945 by Mortimer Wheeler and his trainee, Ahmad Hasan Dani. The last major series of excavations were conducted in 1964 and 1965 by George F. Dales. After 1965 excavations were banned due to weathering damage to the exposed structures, and the only projects allowed at the site since have been salvage excavations, surface surveys, and conservation projects. In the 1980s, German and Italian survey groups led by Michael Jansen and Maurizio Tosi used less invasive archeological techniques, such as architectural documentation, surface surveys, and localized probing, to gather further information about Mohenjo-daro. A dry core drilling conducted in 2015 by Pakistan's National Fund for Mohenjo-daro revealed that the site is larger than the unearthed area.\nMohenjo-daro has a planned layout with rectilinear buildings arranged on a grid plan. Most were built of fired and mortared brick; some incorporated sun-dried mud-brick and wooden superstructures. The covered area of Mohenjo-daro is estimated at 300 hectares. The Oxford Handbook of Cities in World History offers a weak estimate of a peak population of around 40,000.\nThe sheer size of the city, and its provision of public buildings and facilities, suggests a high level of social organization. The city is divided into two parts, the so-called Citadel and the Lower City. The Citadel – a mud-brick mound around 12 metres (39 ft) high – is known to have supported public baths, a large residential structure designed to house about 5,000 citizens, and two large assembly halls. The city had a central marketplace, with a large central well. Individual households or groups of households obtained their water from smaller wells. Waste water was channeled to covered drains that lined the major streets. Some houses, presumably those of more prestigious inhabitants, include rooms that appear to have been set aside for bathing, and one building had an underground furnace (known as a hypocaust), possibly for heated bathing. Most houses had inner courtyards, with doors that opened onto side-lanes. Some buildings had two stories.\nIn 1950, Sir Mortimer Wheeler identified one large building in Mohenjo-daro as a Great Granary. Certain wall-divisions in its massive wooden superstructure appeared to be grain storage-bays, complete with air-ducts to dry the grain. According to Wheeler, carts would have brought grain from the countryside and unloaded them directly into the bays. However, Jonathan Mark Kenoyer noted the complete lack of evidence for grain at the granary, which, he argued, might therefore be better termed a Great Hall of uncertain function. Close to the Great Granary is a large and elaborate public bath, sometimes called the Great Bath. From a colonnaded courtyard, steps lead down to the brick-built pool, which was waterproofed by a lining of bitumen. The pool measures 12 metres (39 ft) long, 7 metres (23 ft) wide and 2.4 metres (7.9 ft) deep. It may have been used for religious purification. Other large buildings include a Pillared Hall, thought to be an assembly hall of some kind, and the so-called College Hall, a complex of buildings comprising 78 rooms, thought to have been a priestly residence.\nThe location of Mohenjo-daro was built in a relatively short period of time, with the water supply system and wells being some of the first planned constructions. With the excavations done so far, over 700 wells are present at Mohenjo-daro, alongside drainage and bathing systems. This number is unheard of when compared to other civilizations at the time, such as Egypt or Mesopotamia, and the quantity of wells transcribes as one well for every three houses. Because the large number of wells, it is believed that the inhabitants relied solely on annual rainfall, as well as the Indus River's course remaining close to the site, alongside the wells providing water for long periods of time in the case of the city coming under siege. Due to the period in which these wells were built and used, it is likely that the circular brick well design used at this and many other Harappan sites are an invention that should be credited to the Indus civilization, as there is no existing evidence of this design from Mesopotamia or Egypt at this time, and even later. Sewage and waste water for buildings at the site were disposed of via a centralized drainage system that ran alongside the site's streets. These drains that ran alongside the road were effective at allowing most human waste and sewage to be disposed of as the drains most likely took the waste toward the Indus River.\nThe city also had large platforms perhaps intended as defense against flooding. According to a theory first advanced by Wheeler, the city could have been flooded and silted over, perhaps six times, and later rebuilt in the same location. For some archaeologists, it was believed that a final flood that helped engulf the city in a sea of mud brought about the abandonment of the site. Gregory Possehl was the first to theorize that the floods were caused by overuse and expansion upon the land, and that the mud flood was not the reason the site was abandoned. Instead of a mud flood wiping part of the city out in one fell swoop, Possehl coined the possibility of constant mini-floods throughout the year, paired with the land being worn out by crops, pastures, and resources for bricks and pottery spelled the downfall of the site.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_mahenjo_daro.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Mohenjo-daro",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 55,
        "title": "History of The Cave of Altamira",
        "category": "Sites",
        "textInfo": "The Cave of Altamira is a cave complex, located near the historic town of Santillana del Mar in Cantabria, Spain. It is renowned for prehistoric cave art featuring charcoal drawings and polychrome paintings of contemporary local fauna and human hands. The earliest paintings were applied during the Upper Paleolithic, around 36,000 years ago. The site was discovered in 1868 by Modesto Cubillas and subsequently studied by Marcelino Sanz de Sautuola.\nAside from the striking quality of its polychromatic art, Altamira's fame stems from the fact that its paintings were the first European cave paintings for which a prehistoric origin was suggested and promoted. Sautuola published his research with the support of Juan de Vilanova y Piera in 1880, to initial public acclaim.\nHowever, the publication of Sanz de Sautuola's research quickly led to a bitter public controversy among experts, some of whom rejected the prehistoric origin of the paintings on the grounds that prehistoric human beings lacked sufficient ability for abstract thought. The controversy continued until 1902, by which time reports of similar findings of prehistoric paintings in the Franco-Cantabrian region had accumulated and the evidence could no longer be rejected.\nAltamira is located in the Franco-Cantabrian region and in 1985 was declared a World Heritage Site by UNESCO as a key location of the Cave of Altamira and Paleolithic Cave Art of Northern Spain. The cave can no longer be visited, for conservation reasons, but there are replicas of a section at the site and elsewhere.\nIn 1879, amateur archaeologist Marcelino Sanz de Sautuola was led by his eight-year-old daughter María to discover the cave's drawings. The cave was excavated by Sautuola and archaeologist Juan Vilanova y Piera from the University of Madrid, resulting in a much acclaimed publication in 1880 which interpreted the paintings as Paleolithic in origin. The French specialists, led by Gabriel de Mortillet and Émile Cartailhac, were particularly adamant in rejecting the hypothesis of Sautuola and Piera, whose findings were loudly ridiculed at the 1880 Prehistorical Congress in Lisbon.\nDue to the high artistic quality, and the exceptional state of conservation of the paintings, Sautuola was accused of forgery, as he was unable to answer why there were no soot (smoke) marks on the walls and ceilings of the cave. A fellow countryman maintained that the paintings had been produced by a contemporary artist, on Sautuola's orders. Later, Sautuola found out the artist could have used marrow fat as oil for the lamp, producing much less soot than any other combustibles.\nIt was not until 1902, when several other findings of prehistoric paintings had served to render the hypothesis of the extreme antiquity of the Altamira paintings less offensive, that the scientific society retracted their opposition to the Spaniards. That year, Cartailhac emphatically admitted his mistake in the famous article, Mea culpa d'un sceptique, published in the journal L'Anthropologie. Sautuola, having died 14 years earlier, did not live to witness his rehabilitation.",
        "imageUrl": "https://github.com/rukahtka/Demo/blob/main/ImageAndJson/images/history_of_altamira.jpeg?raw=true",
        "sourceUrl": "https://en.wikipedia.org/wiki/Cave_of_Altamira",
        "subCategory": "",
        "isSubCategory": false
    }
]
