[{
		"id": 1,
		"title": "History Of Cricket",
		"category": "sports",
		"textInfo": "There is a consensus of expert opinion that cricket may have been invented during Saxon or Norman times by children living in the Weald, an area of dense woodlands and clearings in south-east England. The first reference to cricket being played as an adult sport was in 1611, and in the same year, a dictionary defined cricket as a boys' game. There is also the thought that cricket may have derived from bowls, by the intervention of a batsman trying to stop the ball from reaching its target by hitting it away.\nIn the first half of the 18th Century cricket established itself as a leading sport in London and the south-eastern counties of England. Its spread was limited by the constraints of travel, but it was slowly gaining popularity in other parts of England and Women’s Cricket dates back to the 1745, when the first known match was played in Surrey.\nIn 1744, the first Laws of Cricket were written and subsequently amended in 1774, when innovations such as lbw, a 3rd stump, - the middle stump and a maximum bat width were added. The codes were drawn up by the “Star and Garter Club” whose members ultimately founded the famous Marylebone Cricket Club at Lord's in 1787. MCC immediately became the custodian of the Laws and has made revisions ever since then to the current day.",
		"imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_cricket.jpg",
		"sourceUrl": "https://www.icc-cricket.com/about/cricket/history-of-cricket/early-cricket",
		"subCategory": "cricket",
		"isSubCategory": true
	},
	{
		"id": 2,
		"title": "Cricket in India",
		"category": "sports",
		"textInfo": "It was sometime in 1721 that a British ship dropped anchor off the coast of Kutch in western India. The recreational activities the sailors indulged in on the coast elicited curious reactions from onlookers. One of the sailors, who answered to the name of Downing, recalled his time on the Kutch coast in his memoirs thus: \"We everyday diverted ourselves with playing cricket and other exercises\"\n This is the earliest recorded reference to cricket in India.\nAs the merchants metamorphosed into rulers, they continued to demonstrate their recreational pursuits on Indian soil. The British army took on the English settlers in what was the first recorded cricket match in India in 1751.\nThe establishment of the Calcutta Cricket Club (what we know today as CC & FC) in 1792, was another watershed for the sport in the land. In fact, it is the second-oldest cricket club in the world, after the MCC (1787).",
		"imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_india_cricket.jpeg",
		"sourceUrl": "https://www.bcci.tv/about",
		"subCategory": "cricket",
		"isSubCategory": true
	},
	{
		"id": 3,
		"title": "The first cricket ball was made of wool",
		"category": "sports",
		"textInfo": "Although no one knows for sure how cricket started, it thought that it was invented by shepherds, who came up with the idea as a way to pass the time whilst guarding their sheep. Our first fact about cricket is that the first cricket ball was most likely a ball of rolled up wool – so today’s bowling speeds were most likely unachievable.\nThe first official mention of cricket in England was in 1597, when a court case relating to the ownership of a plot of land referred to the game of “creckett”. It was to be several centuries before international cricket came about though, with the first official test match taking place in 1877. It pitted England against Australia at the iconic Melbourne Cricket Ground, with the Aussies taking the win.",
		"imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/first_cricket_ball_made_of_wool.jpg",
		"sourceUrl": "https://dayoutinengland.com/facts-about-cricket-in-england/",
		"subCategory": "cricket",
		"isSubCategory": true
	},
	{
		"id": 4,
		"title": "The longest cricket match was 14 days long",
		"category": "sports",
		"textInfo": "It’s often joked in England that cricket goes on for far too long, with games often lasting for hours, especially with frequent breaks thanks to the indecisive British weather (cricket can’t be played in the rain or strong wind). But the longest ever cricket match was played in 1939, in a contest between England and South Africa. Forget hours, this match lasted a ridiculous 14 days.\nAnd even then the game had to be declared as a draw before it was finished, because the English ship was due to leave to take the team back home.",
		"imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/longest_cricket_math_14_days.jpg,
		"sourceUrl": "https://dayoutinengland.com/facts-about-cricket-in-england/",
		"subCategory": "cricket",
		"isSubCategory": true
	},
	{
		"id": 5,
		"title": "Cricket is the second most popular sport in the world",
		"category": "sports",
		"textInfo": "Cricket has grown and grown since its inception in the 16th century. It’s now enjoyed in over 180 countries around the world, with approximately 2.5 billion fans watching or playing the sport. How crazy are those numbers!?\nIt’s most popular in India and Pakistan, though England and Australia have two of the most famous teams.",
		"imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/cricket_second_most_popular_sport.jpg",
		"sourceUrl": "https://www.funfactsabout.com/fun-facts-about-cricket/",
		"subCategory": "cricket",
		"isSubCategory": true
	},
    {
        "id": 6,
        "title": "History of Formula 1",
        "category": "sports",
        "textInfo": "The modern era of Formula One began in 1950, but the roots of Grand Prix racing are far earlier, tracing to the pioneering road races in France in the 1890s, through the Edwardian years, the bleak twenties, the German domination of the 1930s and the early post-war years of Italian supremacy.\nRegarded as the first motor race proper was a 1,200 km road race from Paris to Bordeaux and back in 1895, won by Émile Levassor with his Panhard et Levassor in 48 hours. One of the most successful drivers of the early year was Fernand Charron, who won the Paris-Bordeaux race in 1899, also in a Panhard, at the blazing average speed of 29.9 mph.\nThe first race using the appellation “Grand Prix” was 1901’s French Grand Prix at Le Mans, won by Ferencz Szisz with a Renault, who covered the 700 miles at 63.0 mph.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_formula_1.jpg",
        "sourceUrl": "http://www.f1-grandprix.com/?page_id=222",
        "subCategory": "formula_1",
        "isSubCategory": true
    },
    {
        "id": 7,
        "title": "History of Ferrari",
        "category": "sports",
        "textInfo": "Scuderia Ferrari was founded by Enzo Ferrari in 1929 to enter amateur drivers in various races. However, Ferrari himself had raced in CMN (Costruzioni Meccaniche Nazionali) and Alfa Romeo cars before that date. The idea came about on the night of 16 November at a dinner in Bologna, where Ferrari solicited financial help from textile heirs Augusto and Alfredo Caniato and wealthy amateur racer Mario Tadini. He then gathered a team which at its peak included over forty drivers, most of whom raced in various Alfa Romeo 8C cars; Ferrari himself continued racing, with moderate success, until the birth of his first son Dino in 1932. The well-known prancing horse blazon first appeared at the 1932 Spa 24 Hours in Belgium on a two-car team of Alfa Romeo 8C 2300 Spiders, which finished first and second.\nIn 1933 Alfa Romeo experienced economic difficulties and withdrew its in-house team from racing. From then, the Scuderia Ferrari became the acting racing team of Alfa Romeo when the factory released to the Scuderia the up-to-date Monoposto Tipo B racers. In 1935 Enzo Ferrari and Luigi Bazzi built the Alfa Romeo Bimotore, the first car to wear a Ferrari badge on the radiator cowl.\nIn the winter of 1939–1940, Ferrari started work on a racecar of his own, the Tipo 815 (eight cylinders, 1.5 L displacement). The 815s, designed by Alberto Massimino, were thus the first true Ferrari cars, but after Alberto Ascari and the Marchese Lotario Rangoni Machiavelli di Modena drove them in the 1940 Mille Miglia, World War II put a temporary end to racing and the 815s saw no more competition.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/ferrari_history.png",
        "sourceUrl": "https://en.wikipedia.org/wiki/Scuderia_Ferrari",
        "subCategory": "formula_1",
        "isSubCategory": true
    },
    {
        "id": 8,
        "title": "F1 Cars Have 80k Components",
        "category": "sports",
        "textInfo": "Engineers assemble 80,000 components for just one car. Take note that all of these components are important to perform well during the race.\nThis is why it must be properly placed and assembled. It takes time to finalize the parts to be put in an F1 car and test their efficiency.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/f1_car_80k_component.jpg",
        "sourceUrl": "https://xsportnet.com/fun-facts-that-few-people-know-about-formula-1/",
        "subCategory": "formula_1",
        "isSubCategory": true
    },
    {
        "id": 9,
        "title": "F1 Drivers Lose Weight During Race",
        "category": "sports",
        "textInfo": "F1 cars are hot; literally, F1 drivers are exposed to this high level of heat during a competition. You also have to take note that cockpits in the race track are heated as well.\nWith this immense heat, F1 drivers lose an average of 4kgs in a single match.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/f1_drivers_lose_weight.jpg",
        "sourceUrl": "https://xsportnet.com/fun-facts-that-few-people-know-about-formula-1/",
        "subCategory": "formula_1",
        "isSubCategory": true
    },
    {
        "id": 10,
        "title": "History of Baseball",
        "category": "sports",
        "textInfo": "References to games resembling baseball in the United States date back to the 18th century. Its most direct ancestors appear to be two English games: rounders (a children’s game brought to New England by the earliest colonists) and cricket.\nIn September 1845, a group of New York City men founded the New York Knickerbocker Baseball Club. One of them—volunteer firefighter and bank clerk Alexander Joy Cartwright—would codify a new set of rules that would form the basis for modern baseball, calling for a diamond-shaped infield, foul lines and the three-strike rule. He also abolished the dangerous practice of tagging runners by throwing balls at them.\nCartwright’s changes made the burgeoning pastime faster-paced and more challenging while clearly differentiating it from older games like cricket. In 1846, the Knickerbockers played the first official game of baseball against a team of cricket players, beginning a new, uniquely American tradition.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_baseball.jpeg",
        "sourceUrl": "https://www.history.com/news/who-invented-baseball",
        "subCategory": "baseball",
        "isSubCategory": true
    },
    {
        "id": 11,
        "title": "History of New York Yankees",
        "category": "sports",
        "textInfo": "The franchise began in 1901 in Baltimore, Maryland, competing as the Orioles in the AL for two seasons. The struggling Baltimore team was bought by Frank Farrell and Bill Devery in 1903 and taken to New York, initially to Hilltop Park (1903–12), one of Manhattan’s highest points, which led to the name New York Highlanders. Local sportswriters often referred to the team as “Yankees” or “Yanks,” because the team was in the American League. After the club moved to the Polo Grounds in 1913, the name Highlanders fell further into disuse, and the team was officially renamed the Yankees.\nThe team was not a regular pennant contender during its first 18 years in New York. Its fortunes changed completely in 1920, however, with the acquisition of Ruth from the Red Sox for cash and a loan against Boston’s Fenway Park—the most famous sale in baseball history. With the superstar pitcher-turned-outfielder leading the charge, the Yankees dynasty began to take shape during his second season with the team. It won three consecutive AL championships and the team’s first World Series title (1923).",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_new_york_yankees.jpeg",
        "sourceUrl": "https://www.britannica.com/topic/New-York-Yankees",
        "subCategory": "baseball",
        "isSubCategory": true
    },
    {
        "id": 12,
        "title": "What is the oldest known piece of music?",
        "category": "music",
        "textInfo": "The history of music is as old as humanity itself. Archaeologists have found primitive flutes made of bone and ivory dating back as far as 43,000 years, and it’s likely that many ancient musical styles have been preserved in oral traditions.\nWhen it comes to specific songs, however, the oldest known examples are relatively more recent. The earliest fragment of musical notation is found on a 4,000-year-old Sumerian clay tablet, which includes instructions and tunings for a hymn honoring the ruler Lipit-Ishtar. But for the title of oldest extant song, most historians point to “Hurrian Hymn No. 6,” an ode to the goddess Nikkal that was composed in cuneiform by the ancient Hurrians sometime around the 14th century B.C.\n“Hurrian Hymn No. 6” is considered the world’s earliest melody, but the oldest musical composition to have survived in its entirety is a first century A.D. Greek tune known as the “Seikilos Epitaph.” The song was found engraved on an ancient marble column used to mark a woman’s gravesite in Turkey. “I am a tombstone, an image,” reads an inscription. “Seikilos placed me here as an everlasting sign of deathless remembrance".",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/oldest_peice_of_music.jpeg",
        "sourceUrl": "https://www.history.com/news/what-is-the-oldest-known-piece-of-music",
        "subCategory": "oldMusic",
        "isSubCategory": true
    },
    {
        "id": 13,
        "title": "Opera history",
        "category": "music",
        "textInfo": "Opera originated in Italy at the end of the 16th century (with Jacopo Peri's mostly lost Dafne, produced in Florence in 1598) especially from works by Claudio Monteverdi, notably L'Orfeo, and soon spread through the rest of Europe Dafne by Jacopo Peri was the earliest composition considered opera, as understood today. It was written around 1597, largely under the inspiration of an elite circle of literate Florentine humanists who gathered as the Camerata de Bardi.\nA later work by Peri, Euridice, dating from 1600, is the first opera score to have survived until the present day. However, the honour of being the first opera still to be regularly performed goes to Claudio Monteverdi's L'Orfeo, composed for the court of Mantua in 1607.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_opera.jpg",
        "sourceUrl": "https://en.wikipedia.org/wiki/Opera",
        "subCategory": "operaMusic",
        "isSubCategory": true
    },
    {
        "id": 14,
        "title": "Rock Music",
        "category": "music",
        "textInfo": "The history of rock music has been volatile and unpredictable as the genre has constantly redefined and reinvented itself since its emergence in the late 1940s.\nRock’s origins can be traced to the late 1940s, when the popular styles of the day, country music and blues, morphed into a new sound aided by electric guitars and a steady drumbeat. Pioneering rock artists of the 1950s such as Chuck Berry leaned heavily on classic blues structures while demonstrating a flair as natural-born entertainers.\nAs the '80s began, mainstream rock was losing commercial steam, its sound growing stale. In such a creatively stagnant environment, subgenres started to assert their dominance.\nInspired by punk’s outsider status and industrial’s eclectic instrumentation, keyboard-driven English bands such as Depeche Mode demonstrated a more introverted songwriting style, creating post-punk, also described as new wave.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_rock_music.jpeg",
        "sourceUrl": "https://www.liveabout.com/what-is-rock-music-2898293",
        "subCategory": "rockMusic",
        "isSubCategory": true
    },
    {
        "id": 15,
        "title": "Ancient India",
        "category": "countries",
        "textInfo": "By 55,000 years ago, the first modern humans, or Homo sapiens, had arrived on the Indian subcontinent from Africa, where they had earlier evolved. The earliest known modern human remains in South Asia date to about 30,000 years ago.\nDuring the period 2000–500 BCE, many regions of the subcontinent transitioned from the Chalcolithic cultures to the Iron Age ones. The Vedas, the oldest scriptures associated with Hinduism, were composed during this period, and historians have analysed these to posit a Vedic culture in the Punjab region and the upper Gangetic Plain. Most historians also consider this period to have encompassed several waves of Indo-Aryan migration into the subcontinent from the north-west.\nIn the late Vedic period, around the 6th century BCE, the small states and chiefdoms of the Ganges Plain and the north-western regions had consolidated into 16 major oligarchies and monarchies that were known as the mahajanapadas. The emerging urbanisation gave rise to non-Vedic religious movements, two of which became independent religions. Jainism came into prominence during the life of its exemplar, Mahavira. Buddhism, based on the teachings of Gautama Buddha, attracted followers from all social classes excepting the middle class; chronicling the life of the Buddha was central to the beginnings of recorded history in India.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_ancient_india.jpeg",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    },
    {
        "id": 16,
        "title": "Medieval India",
        "category": "countries",
        "textInfo": "The Indian early medieval age, from 600 to 1200 CE, is defined by regional kingdoms and cultural diversity. When Harsha of Kannauj, who ruled much of the Indo-Gangetic Plain from 606 to 647 CE, attempted to expand southwards, he was defeated by the Chalukya ruler of the Deccan. When his successor attempted to expand eastwards, he was defeated by the Pala king of Bengal. When the Chalukyas attempted to expand southwards, they were defeated by the Pallavas from farther south, who in turn were opposed by the Pandyas and the Cholas from still farther south.\nIn the 6th and 7th centuries, the first devotional hymns were created in the Tamil language.They were imitated all over India and led to both the resurgence of Hinduism and the development of all modern languages of the subcontinent.Indian royalty, big and small, and the temples they patronised drew citizens in great numbers to the capital cities, which became economic hubs as well. Temple towns of various sizes began to appear everywhere as India underwent another urbanisation.\nBy the 8th and 9th centuries, the effects were felt in South-East Asia, as South Indian culture and political systems were exported to lands that became part of modern-day Myanmar, Thailand, Laos, Brunei, Cambodia, Vietnam, Philippines, Malaysia, and Indonesia.Indian merchants, scholars, and sometimes armies were involved in this transmission; South-East Asians took the initiative as well, with many sojourning in Indian seminaries and translating Buddhist and Hindu texts into their languages.",
        "imageUrl": "https://raw.githubusercontent.com/rukahtka/Demo/main/AppData/history_of_medieval_india.jpg",
        "sourceUrl": "https://en.wikipedia.org/wiki/India",
        "subCategory": "",
        "isSubCategory": false
    }
]
